[{"id":"1111a0/fresh soybeans, canola, flaxseeds, and other oilseeds/us","index":0,"name":"Fresh soybeans, canola, flaxseeds, and other oilseeds","code":"1111A0","location":"US","description":"BEA Code \u0026 Name is '1111A0:Oilseed farming'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in growing oilseed crops. These crops have an annual life cycle and are typically grown in open fields. Related NAICS codes are: 11111-2"},{"id":"1111b0/fresh wheat, corn, rice, and other grains/us","index":1,"name":"Fresh wheat, corn, rice, and other grains","code":"1111B0","location":"US","description":"BEA Code \u0026 Name is '1111B0:Grain farming'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in producing grain seeds. These crops have an annual life cycle and are typically grown in open fields. Related NAICS codes are: 11113-6, 11119"},{"id":"111200/fresh vegetables, melons, and potatoes/us","index":2,"name":"Fresh vegetables, melons, and potatoes","code":"111200","location":"US","description":"BEA Code \u0026 Name is '111200:Vegetable and melon farming'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in growing root and tuber crops (except sugar beets and peanuts) or edible plants and/or producing root and tuber or edible plant seeds. The crops included in this group have an annual growth cycle and are grown in open fields. Climate and cultural practices limit producing areas but often permit the growing of a combination of crops in a year."},{"id":"111300/fresh fruits and tree nuts/us","index":3,"name":"Fresh fruits and tree nuts","code":"111300","location":"US","description":"BEA Code \u0026 Name is '111300:Fruit and tree nut farming'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in growing fruit and/or tree nut crops. The crops included in this industry group are generally not grown from seeds and have a perennial life cycle."},{"id":"111400/greenhouse crops, mushrooms, nurseries, and flowers/us","index":4,"name":"Greenhouse crops, mushrooms, nurseries, and flowers","code":"111400","location":"US","description":"BEA Code \u0026 Name is '111400:Greenhouse, nursery, and floriculture production'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in growing crops of any kind under cover and/or growing nursery stock and flowers. \"Under cover\" is generally defined as greenhouses, cold frames, cloth houses, and lath houses. The crops grown are removed at various stages of maturity and have annual and perennial life cycles. The nursery stock includes short rotation woody crops that have growth cycles of 10 years or less."},{"id":"111900/tobacco, cotton, sugarcane, peanuts, sugar beets, herbs and spices, and other crops/us","index":5,"name":"Tobacco, cotton, sugarcane, peanuts, sugar beets, herbs and spices, and other crops","code":"111900","location":"US","description":"BEA Code \u0026 Name is '111900:Other crop farming'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in (1) growing crops (except oilseed and/or grain; vegetable and/or melon; fruit and tree nut; and greenhouse, nursery, and/or floriculture products). These establishments grow crops, such as tobacco, cotton, sugarcane, hay, sugar beets, peanuts, agave, herbs and spices, and hay and grass seeds; or (2) growing a combination of crops (except a combination of oilseed(s) and grain(s) and a combination of fruit(s) and tree nut(s))."},{"id":"1121a0/cattle ranches and feedlots/us","index":6,"name":"Cattle ranches and feedlots","code":"1121A0","location":"US","description":"BEA Code \u0026 Name is '1121A0:Beef cattle ranching and farming, including feedlots and dual-purpose ranching and farming'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in raising cattle, milking dairy cattle, or feeding cattle for fattening. Related NAICS codes are: 11211, 11213"},{"id":"112120/dairies/us","index":7,"name":"Dairies","code":"112120","location":"US","description":"BEA Code \u0026 Name is '112120:Dairy cattle and milk production'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in milking dairy cattle."},{"id":"112a00/animal farms and aquaculture ponds (except cattle and poultry)/us","index":8,"name":"Animal farms and aquaculture ponds (except cattle and poultry)","code":"112A00","location":"US","description":"BEA Code \u0026 Name is '112A00:Animal production, except cattle and poultry and eggs'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Animal Production and Aquaculture subsector raise or fatten animals for the sale of animals or animal products and/or raise aquatic plants and animals in controlled or selected aquatic environments for the sale of aquatic plants, animals, or their products. The subsector includes establishments, such as ranches, farms, and feedlots, primarily engaged in keeping, grazing, breeding, or feeding animals. These animals are kept for the products they produce or for eventual sale. The animals are generally raised in various environments, from total confinement or captivity to feeding on an open range pasture.  The industries in this subsector are grouped by important factors, such as suitable grazing or pasture land, specialized buildings, type of equipment, and the amount and types of labor required. Establishments are classified in the Animal Production and Aquaculture subsector when animal production (i.e., value of animals for market) accounts for one-half or more of the establishment's total agricultural production. Establishments with one-half or more animal production with no one animal product or family of animal products of an industry accounting for one-half of the establishment's agricultural production are treated as combination animal farming classified in Industry 11299, All Other Animal Production. Related NAICS codes are: 1122, 1124-5, 1129, *112"},{"id":"112300/poultry farms/us","index":9,"name":"Poultry farms","code":"112300","location":"US","description":"BEA Code \u0026 Name is '112300:Poultry and egg production'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in breeding, hatching, and raising poultry for meat or egg production."},{"id":"113000/timber and raw forest products/us","index":10,"name":"Timber and raw forest products","code":"113000","location":"US","description":"BEA Code \u0026 Name is '113000:Forestry and logging'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Forestry and Logging subsector grow and harvest timber on a long production cycle (i.e., of 10 years or more). Long production cycles use different production processes than short production cycles, which require more horticultural interventions prior to harvest, resulting in processes more similar to those found in the Crop Production subsector. Consequently, Christmas tree production and other production involving production cycles of less than 10 years, are classified in the Crop Production subsector. Industries in this subsector specialize in different stages of the production cycle. Reforestation requires production of seedlings in specialized nurseries. Timber production requires natural forest or suitable areas of land that are available for a long duration. The maturation time for timber depends upon the species of tree, the climatic conditions of the region, and the intended purpose of the timber. The harvesting of timber (except when done on an extremely small scale) requires specialized machinery unique to the industry. Establishments gathering forest products, such as gums, barks, balsam needles, rhizomes, fibers, Spanish moss, and ginseng and truffles, are also included in this subsector."},{"id":"114000/wild-caught fish and game/us","index":11,"name":"Wild-caught fish and game","code":"114000","location":"US","description":"BEA Code \u0026 Name is '114000:Fishing, hunting and trapping'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Fishing, Hunting, and Trapping subsector harvest fish and other wild animals from their natural habitats and are dependent upon a continued supply of the natural resource. The harvesting of fish is the predominant economic activity of this subsector and it usually requires specialized vessels that, by the nature of their size, configuration and equipment, are not suitable for any other type of production, such as transportation. Hunting and trapping activities utilize a wide variety of production processes and are classified in the same subsector as fishing because the availability of resources and the constraints imposed, such as conservation requirements and proper habitat maintenance, are similar."},{"id":"115000/agriculture and forestry support/us","index":12,"name":"Agriculture and forestry support","code":"115000","location":"US","description":"BEA Code \u0026 Name is '115000:Support activities for agriculture and forestry'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Support Activities for Agriculture and Forestry subsector provide support services that are an essential part of agricultural and forestry production. These support activities may be performed by the agriculture or forestry producing establishment or conducted independently as an alternative source of inputs required for the production process for a given crop, animal, or forestry industry. Establishments that primarily perform these activities independent of the agriculture or forestry producing establishment are in this subsector."},{"id":"211000/unrefined oil and gas/us","index":13,"name":"Unrefined oil and gas","code":"211000","location":"US","description":"BEA Code \u0026 Name is '211000:Oil and gas extraction'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Oil and Gas Extraction subsector operate and/or develop oil and gas field properties. Such activities may include exploration for crude petroleum and natural gas; drilling, completing, and equipping wells; operating separators, emulsion breakers, desilting equipment, and field gathering lines for crude petroleum and natural gas; and all other activities in the preparation of oil and gas up to the point of shipment from the producing property. This subsector includes the production of crude petroleum, the mining and extraction of oil from oil shale and oil sands, and the production of natural gas, sulfur recovery from natural gas, and recovery of hydrocarbon liquids. Establishments in this subsector include those that operate oil and gas wells on their own account or for others on a contract or fee basis. Establishments primarily engaged in providing support services, on a fee or contract basis, required for the drilling or operation of oil and gas wells (except geophysical surveying and mapping, mine site preparation, and construction of oil/gas pipelines) are classified in Subsector 213, Support Activities for Mining."},{"id":"212100/coal/us","index":14,"name":"Coal","code":"212100","location":"US","description":"BEA Code \u0026 Name is '212100:Coal mining'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in one or more of the following: (1) mining bituminous coal, anthracite, and lignite by underground mining, auger mining, strip mining, culm bank mining, and other surface mining; (2) developing coal mine sites; and (3) beneficiating (i.e., preparing) coal (e.g., cleaning, washing, screening, and sizing coal)."},{"id":"2122a0/iron, gold, silver, and other metal ores/us","index":15,"name":"Iron, gold, silver, and other metal ores","code":"2122A0","location":"US","description":"BEA Code \u0026 Name is '2122A0:Iron, gold, silver, and other metal ore mining'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in developing mine sites or mining metallic minerals, and establishments primarily engaged in ore dressing and beneficiating (i.e., preparing) operations, such as crushing, grinding, washing, drying, sintering, concentrating, calcining, and leaching. Beneficiating may be performed at mills operated in conjunction with the mines served or at mills, such as custom mills, operated separately. Related NAICS codes are: 21221, 21222, 21229"},{"id":"212230/copper, nickel, lead, and zinc/us","index":16,"name":"Copper, nickel, lead, and zinc","code":"212230","location":"US","description":"BEA Code \u0026 Name is '212230:Copper, nickel, lead, and zinc mining'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in developing the mine site, mining, and/or beneficiating (i.e., preparing) ores valued chiefly for their copper, nickel, lead, or zinc content. Beneficiating includes the transformation of ores into concentrates."},{"id":"212310/dimensional stone/us","index":17,"name":"Dimensional stone","code":"212310","location":"US","description":"BEA Code \u0026 Name is '212310:Stone mining and quarrying'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises (1) establishments primarily engaged in developing the mine site, mining or quarrying dimension stone (i.e., rough blocks and/or slabs of stone), or mining and quarrying crushed and broken stone and/or (2) preparation plants primarily engaged in beneficiating stone (e.g., crushing, grinding, washing, screening, pulverizing, and sizing)."},{"id":"2123a0/sand, gravel, clay, phosphate, other nonmetallic minerals/us","index":18,"name":"Sand, gravel, clay, phosphate, other nonmetallic minerals","code":"2123A0","location":"US","description":"BEA Code \u0026 Name is '2123A0:Other nonmetallic mineral mining and quarrying'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in developing mine sites, or in mining or quarrying nonmetallic minerals (except fuels). Also included are certain well and brine operations, and preparation plants primarily engaged in beneficiating (e.g., crushing, grinding, washing, and concentrating) nonmetallic minerals.   Beneficiation is the process whereby the extracted material is reduced to particles which can be separated into mineral and waste, the former suitable for further processing or direct use. The operations that take place in beneficiation are primarily mechanical, such as grinding, washing, magnetic separation, and centrifugal separation. In contrast, manufacturing operations primarily use chemical and electrochemical processes, such as electrolysis and distillation. However, some treatments, such as heat treatments, take place in both the beneficiation and the manufacturing (i.e., smelting/refining) stages. The range of preparation activities varies by mineral and the purity of any given ore deposit. While some minerals, such as petroleum and natural gas, require little or no preparation, others are washed and screened, while yet others, such as gold and silver, can be transformed into bullion before leaving the mine site. Related NAICS codes are: 21232, 21239"},{"id":"213111/well drilling/us","index":19,"name":"Well drilling","code":"213111","location":"US","description":"BEA Code \u0026 Name is '213111:Drilling oil and gas wells'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in drilling oil and gas wells for others on a contract or fee basis. This industry includes contractors that specialize in spudding in, drilling in, redrilling, and directional drilling."},{"id":"21311a/other support activities for mining/us","index":20,"name":"Other support activities for mining","code":"21311A","location":"US","description":"BEA Code \u0026 Name is '21311A:Other support activities for mining'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in providing support services, on a contract or fee basis, required for the mining and quarrying of minerals and for the extraction of oil and gas. Drilling, taking core samples, and making geological observations at prospective sites (except geophysical surveying and mapping) for minerals, on a contract or fee basis, are included in this industry. Related NAICS codes are: 213112-5"},{"id":"221100/electricity/us","index":21,"name":"Electricity","code":"221100","location":"US","description":"BEA Code \u0026 Name is '221100:Electric power generation, transmission, and distribution'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in generating, transmitting, and/or distributing electric power. Establishments in this industry group may perform one or more of the following activities: (1) operate generation facilities that produce electric energy; (2) operate transmission systems that convey the electricity from the generation facility to the distribution system; and (3) operate distribution systems that convey electric power received from the generation facility or the transmission system to the final consumer."},{"id":"221200/natural gas/us","index":22,"name":"Natural gas","code":"221200","location":"US","description":"BEA Code \u0026 Name is '221200:Natural gas distribution'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises: (1) establishments primarily engaged in operating gas distribution systems (e.g., mains, meters); (2) establishments known as gas marketers that buy gas from the well and sell it to a distribution system; (3) establishments known as gas brokers or agents that arrange the sale of gas over gas distribution systems operated by others; and (4) establishments primarily engaged in transmitting and distributing gas to final consumers."},{"id":"221300/drinking water and wastewater treatment/us","index":23,"name":"Drinking water and wastewater treatment","code":"221300","location":"US","description":"BEA Code \u0026 Name is '221300:Water, sewage and other systems'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in operating water treatment plants and/or operating water supply systems. The water supply system may include pumping stations, aqueducts, and/or distribution mains. The water may be used for drinking, irrigation, or other uses."},{"id":"230301/nonresidential building repair and maintanence/us","index":24,"name":"Nonresidential building repair and maintanence","code":"230301","location":"US","description":"BEA Code \u0026 Name is '230301:Nonresidential maintenance and repair'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry includes maintenance and repair of nonresidential structures."},{"id":"230302/residential building repair and maintanence/us","index":25,"name":"Residential building repair and maintanence","code":"230302","location":"US","description":"BEA Code \u0026 Name is '230302:Residential maintenance and repair'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises maintenance and repair of residential buildings."},{"id":"233210/health care buildings/us","index":26,"name":"Health care buildings","code":"233210","location":"US","description":"BEA Code \u0026 Name is '233210:Health care structures'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises construction of health care structures"},{"id":"233230/manufacturing buildings/us","index":27,"name":"Manufacturing buildings","code":"233230","location":"US","description":"BEA Code \u0026 Name is '233230:Manufacturing structures'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises construction of manufacturing structures"},{"id":"233240/utilities buildings and infrastructure/us","index":28,"name":"Utilities buildings and infrastructure","code":"233240","location":"US","description":"BEA Code \u0026 Name is '233240:Power and communication structures'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises construction of power and communication structures"},{"id":"233262/schools and vocational buildings/us","index":29,"name":"Schools and vocational buildings","code":"233262","location":"US","description":"BEA Code \u0026 Name is '233262:Educational and vocational structures'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises construction of educational and vocational structures"},{"id":"233293/highways, streets, and bridges/us","index":30,"name":"Highways, streets, and bridges","code":"233293","location":"US","description":"BEA Code \u0026 Name is '233293:Highways and streets'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises construction of highways and streets"},{"id":"2332a0/commercial structures, including farm structures/us","index":31,"name":"Commercial structures, including farm structures","code":"2332A0","location":"US","description":"BEA Code \u0026 Name is '2332A0:Commercial structures, including farm structures'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises construction of commercial structures, including farm structures. Related NAICS codes are: 23"},{"id":"2332b0/other nonresidential structures/us","index":32,"name":"Other nonresidential structures","code":"2332B0","location":"US","description":"BEA Code \u0026 Name is '2332B0:Other nonresidential structures'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises construction of other nonresidential structures Related NAICS codes are: 23"},{"id":"233411/single-family homes/us","index":33,"name":"Single-family homes","code":"233411","location":"US","description":"BEA Code \u0026 Name is '233411:Single-family residential structures'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises construction of single-family residential structures"},{"id":"233412/multifamily homes/us","index":34,"name":"Multifamily homes","code":"233412","location":"US","description":"BEA Code \u0026 Name is '233412:Multifamily residential structures'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises construction of multifamily residential structures"},{"id":"2334a0/other residential structures/us","index":35,"name":"Other residential structures","code":"2334A0","location":"US","description":"BEA Code \u0026 Name is '2334A0:Other residential structures'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises construction of other residential structures Related NAICS codes are: 23"},{"id":"321100/lumber and treated lumber/us","index":36,"name":"Lumber and treated lumber","code":"321100","location":"US","description":"BEA Code \u0026 Name is '321100:Sawmills and wood preservation'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments whose primary production process begins with logs or bolts that are transformed into boards, dimension lumber, beams, timbers, poles, ties, shingles, shakes, siding, and wood chips. Establishments that cut and treat round wood and/or treat wood products made in other establishments to prevent rotting by impregnation with creosote or other chemical compounds are also included in this industry group."},{"id":"321200/plywood and veneer/us","index":37,"name":"Plywood and veneer","code":"321200","location":"US","description":"BEA Code \u0026 Name is '321200:Veneer, plywood, and engineered wood product manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in one or more of the following: (1) manufacturing veneer and/or plywood; (2) manufacturing engineered wood members; and (3) manufacturing reconstituted wood products. This industry includes manufacturing plywood from veneer made in the same establishment or from veneer made in other establishments, and manufacturing plywood faced with nonwood materials, such as plastics or metal."},{"id":"321910/wooden windows, door, and flooring/us","index":38,"name":"Wooden windows, door, and flooring","code":"321910","location":"US","description":"BEA Code \u0026 Name is '321910:Millwork'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing hardwood and softwood cut stock and dimension stock (i.e., shapes); wood windows and wood doors; and other millwork including wood flooring. Dimension stock or cut stock is defined as lumber and worked wood products cut or shaped to specialized sizes. These establishments generally use woodworking machinery, such as jointers, planers, lathes, and routers to shape wood."},{"id":"3219a0/veneer, plywood, and engineered wood/us","index":39,"name":"Veneer, plywood, and engineered wood","code":"3219A0","location":"US","description":"BEA Code \u0026 Name is '3219A0:All other wood product manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in manufacturing wood products (except establishments operating sawmills and wood preservation facilities; and establishments manufacturing veneer, plywood, or engineered wood products). Related NAICS codes are: 32192, 32199"},{"id":"327100/clay and ceramic products/us","index":40,"name":"Clay and ceramic products","code":"327100","location":"US","description":"BEA Code \u0026 Name is '327100:Clay product and refractory manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises (1) Pottery, Ceramics, and Plumbing Fixture Manufacturing, and (2) Clay Building Material and Refractories Manufacturing."},{"id":"327200/glass and glass products/us","index":41,"name":"Glass and glass products","code":"327200","location":"US","description":"BEA Code \u0026 Name is '327200:Glass and glass product manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing glass and/or glass products. Establishments in this industry may manufacture glass and/or glass products by melting silica sand or cullet, or purchasing glass."},{"id":"327310/cement/us","index":42,"name":"Cement","code":"327310","location":"US","description":"BEA Code \u0026 Name is '327310:Cement manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing portland, natural, masonry, pozzolanic, and other hydraulic cements. Cement manufacturing establishments may calcine earths or mine, quarry, manufacture, or purchase lime."},{"id":"327320/ready-mix concrete/us","index":43,"name":"Ready-mix concrete","code":"327320","location":"US","description":"BEA Code \u0026 Name is '327320:Ready-mix concrete manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments, such as batch plants or mix plants, primarily engaged in manufacturing concrete delivered to a purchaser in a plastic and unhardened state. Ready-mix concrete manufacturing establishments may mine, quarry, or purchase sand and gravel."},{"id":"327330/concrete pipe, bricks, and blocks/us","index":44,"name":"Concrete pipe, bricks, and blocks","code":"327330","location":"US","description":"BEA Code \u0026 Name is '327330:Concrete pipe, brick, and block manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing concrete pipe, brick, and block."},{"id":"327390/other concrete products/us","index":45,"name":"Other concrete products","code":"327390","location":"US","description":"BEA Code \u0026 Name is '327390:Other concrete product manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing concrete products (except block, brick, and pipe)."},{"id":"327400/lime and gypsum products/us","index":46,"name":"Lime and gypsum products","code":"327400","location":"US","description":"BEA Code \u0026 Name is '327400:Lime and gypsum product manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises (1) Lime Manufacturing, and (2) Gypsum Product Manufacturing."},{"id":"327910/abrasive products/us","index":47,"name":"Abrasive products","code":"327910","location":"US","description":"BEA Code \u0026 Name is '327910:Abrasive product manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing abrasive grinding wheels of natural or synthetic materials, abrasive-coated products, and other abrasive products."},{"id":"327991/cut stone and stone products/us","index":48,"name":"Cut stone and stone products","code":"327991","location":"US","description":"BEA Code \u0026 Name is '327991:Cut stone and stone product manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in cutting, shaping, and finishing granite, marble, limestone, slate, and other stone for building and miscellaneous uses. Stone product manufacturing establishments may mine, quarry, or purchase stone."},{"id":"327992/ground or treated minerals and earth/us","index":49,"name":"Ground or treated minerals and earth","code":"327992","location":"US","description":"BEA Code \u0026 Name is '327992:Ground or treated mineral and earth manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in calcining, dead burning, or otherwise processing beyond beneficiation, clays, ceramic and refractory minerals, barite, and miscellaneous nonmetallic minerals."},{"id":"327993/mineral wool/us","index":50,"name":"Mineral wool","code":"327993","location":"US","description":"BEA Code \u0026 Name is '327993:Mineral wool manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing mineral wool and mineral wool (i.e., fiberglass) insulation products made of such siliceous materials as rock, slag, and glass or combinations thereof."},{"id":"327999/other nonmetallic mineral products/us","index":51,"name":"Other nonmetallic mineral products","code":"327999","location":"US","description":"BEA Code \u0026 Name is '327999:Miscellaneous nonmetallic mineral products'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing nonmetallic mineral products (except pottery, ceramics, and plumbing fixtures; clay building materials and refractories; glass and glass products; cement; ready-mix concrete; concrete products; lime; gypsum products; abrasive products; cut stone and stone products; ground and treated minerals and earth; and mineral wool)."},{"id":"331110/primary iron, steel, and ferroalloy products/us","index":52,"name":"Primary iron, steel, and ferroalloy products","code":"331110","location":"US","description":"BEA Code \u0026 Name is '331110:Iron and steel mills and ferroalloy manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in one or more of the following: (1) direct reduction of iron ore; (2) manufacturing pig iron in molten or solid form; (3) converting pig iron into steel; (4) manufacturing ferroalloys; (5) making steel; (6) making steel and manufacturing shapes (e.g., bar, plate, rod, sheet, strip, wire); and (7) making steel and forming pipe and tube."},{"id":"331200/secondary steel products/us","index":53,"name":"Secondary steel products","code":"331200","location":"US","description":"BEA Code \u0026 Name is '331200:Steel product manufacturing from purchased steel'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in manufacturing iron and steel tube and pipe, drawing steel wire, and rolling or drawing shapes from purchased iron or steel."},{"id":"33131a/aluminum/us","index":54,"name":"Aluminum","code":"33131A","location":"US","description":"BEA Code \u0026 Name is '33131A:Alumina refining and primary aluminum production'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in (1) refining alumina (i.e., aluminum oxide) generally from bauxite and (2) making aluminum from alumina and/or rolling, drawing, extruding, or casting the aluminum they make into primary forms (e.g., bar, billet, ingot, plate, rod, sheet, strip). Establishments in this industry may make primary aluminum or aluminum-based alloys from alumina.  Related NAICS codes are: 331311-2"},{"id":"33131b/aluminum products/us","index":55,"name":"Aluminum products","code":"33131B","location":"US","description":"BEA Code \u0026 Name is '33131B:Aluminum product manufacturing from purchased aluminum'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in one or more of the following: (1) flat rolling or continuous casting sheet, plate, foil and welded tube from purchased aluminum; (2) recovering aluminum from scrap and flat rolling or continuous casting sheet, plate, foil, and welded tube in integrated mills; (3) extruding aluminum bar, pipe, and tube blooms or extruding or drawing tube from purchased aluminum; (4) recovering aluminum from scrap and extruding bar, pipe, and tube blooms or drawing tube in integrated mills; (5) rolling, drawing, or extruding shapes (except flat rolled sheet, plate, foil, and welded tube; extruded rod, bar, pipe, and tube blooms; and drawn or extruded tube) from purchased aluminum; and/or (6) recovering aluminum from scrap and rolling, drawing or extruding shapes (except flat rolled sheet, plate, foil, and welded tube; extruded rod, bar, pipe, and tube blooms; and drawn or extruded tube) in integrated mills.  Related NAICS codes are: 331315, 331316, 331319"},{"id":"331411/primary copper/us","index":56,"name":"Primary copper","code":"331411","location":"US","description":"BEA Code \u0026 Name is '331411:Primary smelting and refining of copper'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in (1) smelting copper ore and/or (2) the primary refining of copper by electrolytic methods or other processes. Establishments in this industry make primary copper and copper-based alloys, such as brass and bronze, from ore or concentrates."},{"id":"331419/other primary nonferrous metals/us","index":57,"name":"Other primary nonferrous metals","code":"331419","location":"US","description":"BEA Code \u0026 Name is '331419:Primary smelting and refining of nonferrous metal (except copper and aluminum)'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in (1) making (i.e., the primary production) nonferrous metals by smelting ore and/or (2) the primary refining of nonferrous metals by electrolytic methods or other processes."},{"id":"331420/secondary copper products/us","index":58,"name":"Secondary copper products","code":"331420","location":"US","description":"BEA Code \u0026 Name is '331420:Copper rolling, drawing, extruding and alloying'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in one or more of the following: (1) recovering copper or copper alloys from scraps; (2) alloying purchased copper; (3) rolling, drawing, or extruding shapes, (e.g., bar, plate, sheet, strip, tube, wire) from purchased copper; and (4) recovering copper or copper alloys from scrap and rolling, drawing, or extruding shapes (e.g., bar, plate, sheet, strip, tube, wire)."},{"id":"331490/other secondary nonferrous metal products/us","index":59,"name":"Other secondary nonferrous metal products","code":"331490","location":"US","description":"BEA Code \u0026 Name is '331490:Nonferrous metal (except copper and aluminum) rolling, drawing, extruding and alloying'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in one or more of the following: (1) recovering nonferrous metals (except copper and aluminum) and nonferrous metal alloys from scrap; (2) alloying purchased nonferrous metals (except copper and aluminum); (3) rolling, drawing, and extruding shapes from purchased nonferrous metals (except copper and aluminum); and (4) recovering nonferrous metals from scrap (except copper and aluminum) and rolling, drawing, or extruding shapes in integrated facilities."},{"id":"331510/cast iron and steel/us","index":60,"name":"Cast iron and steel","code":"331510","location":"US","description":"BEA Code \u0026 Name is '331510:Ferrous metal foundries'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in pouring molten iron and steel into molds of a desired shape to make castings. Establishments in this industry purchase iron and steel made in other establishments."},{"id":"331520/nonferrous metal casts/us","index":61,"name":"Nonferrous metal casts","code":"331520","location":"US","description":"BEA Code \u0026 Name is '331520:Nonferrous metal foundries'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in pouring and/or introducing molten nonferrous metal, under high pressure, into metal molds or dies to manufacture castings. Establishments in this industry purchase nonferrous metals made in other establishments."},{"id":"33211a/all other forging, stamping, and sintering/us","index":62,"name":"All other forging, stamping, and sintering","code":"33211A","location":"US","description":"BEA Code \u0026 Name is '33211A:All other forging, stamping, and sintering'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in one or more of the following: (1) manufacturing forgings from purchased metals; (2) manufacturing metal custom roll forming products; (3) manufacturing metal stamped and spun products (except automotive, cans, coins); and (4) manufacturing powder metallurgy products. Establishments making metal forgings, metal stampings, and metal spun products and further manufacturing (e.g., machining, assembling) a specific manufactured product are classified in the industry of the finished product. Metal forging, metal stamping, and metal spun products establishments may perform surface finishing operations, such as cleaning and deburring, on the products they manufacture.  Related NAICS codes are: 332111-2, 332117"},{"id":"332114/custom metal rolls/us","index":63,"name":"Custom metal rolls","code":"332114","location":"US","description":"BEA Code \u0026 Name is '332114:Custom roll forming'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in custom roll forming metal products by use of rotary motion of rolls with various contours to bend or shape the products."},{"id":"33211b/lids, jars, bottle caps, other metal closures and crowns/us","index":64,"name":"Lids, jars, bottle caps, other metal closures and crowns","code":"33211B","location":"US","description":"BEA Code \u0026 Name is '33211B:Crown and closure manufacturing and metal stamping'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in one or more of the following: (1) manufacturing forgings from purchased metals; (2) manufacturing metal custom roll forming products; (3) manufacturing metal stamped and spun products (except automotive, cans, coins); and (4) manufacturing powder metallurgy products. Establishments making metal forgings, metal stampings, and metal spun products and further manufacturing (e.g., machining, assembling) a specific manufactured product are classified in the industry of the finished product. Metal forging, metal stamping, and metal spun products establishments may perform surface finishing operations, such as cleaning and deburring, on the products they manufacture.  Related NAICS codes are: 332115-6"},{"id":"332200/cutlery and handtools/us","index":65,"name":"Cutlery and handtools","code":"332200","location":"US","description":"BEA Code \u0026 Name is '332200:Cutlery and handtool manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in one or more of the following: (1) manufacturing nonprecious and precious plated metal cutlery and flatware; (2) manufacturing nonpowered hand and edge tools; (3) manufacturing nonpowered handsaws; (4) manufacturing saw blades, all types (including those for sawing machines); and (5) manufacturing metal kitchen utensils (except cutting-type) and pots and pans (except those manufactured by casting (e.g., cast iron skillets) or stamped without further fabrication)."},{"id":"332310/metal structural products/us","index":66,"name":"Metal structural products","code":"332310","location":"US","description":"BEA Code \u0026 Name is '332310:Plate work and fabricated structural product manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing one or more of the following: (1) prefabricated metal buildings, panels and sections; (2) structural metal products; and (3) metal plate work products."},{"id":"332320/metal windows, doors, and architectural products/us","index":67,"name":"Metal windows, doors, and architectural products","code":"332320","location":"US","description":"BEA Code \u0026 Name is '332320:Ornamental and architectural metal products manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing one or more of the following: (1) metal framed windows (i.e., typically using purchased glass) and metal doors; (2) sheet metal work; and (3) ornamental and architectural metal products."},{"id":"332410/power boilers and heat exchangers/us","index":68,"name":"Power boilers and heat exchangers","code":"332410","location":"US","description":"BEA Code \u0026 Name is '332410:Power boiler and heat exchanger manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing power boilers and heat exchangers. Establishments in this industry may perform installation in addition to manufacturing power boilers and heat exchangers."},{"id":"332420/heavy gauge metal tanks/us","index":69,"name":"Heavy gauge metal tanks","code":"332420","location":"US","description":"BEA Code \u0026 Name is '332420:Metal tank (heavy gauge) manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in cutting, forming, and joining heavy gauge metal to manufacture tanks, vessels, and other containers."},{"id":"332430/light gauge metal cans, boxes, and containers/us","index":70,"name":"Light gauge metal cans, boxes, and containers","code":"332430","location":"US","description":"BEA Code \u0026 Name is '332430:Metal can, box, and other metal container (light gauge) manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in forming light gauge metal containers."},{"id":"332500/metal hinges, keys, lock, and other hardware/us","index":71,"name":"Metal hinges, keys, lock, and other hardware","code":"332500","location":"US","description":"BEA Code \u0026 Name is '332500:Hardware manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing metal hardware, such as metal hinges, metal handles, keys, and locks (except coin-operated, time locks)."},{"id":"332600/springs and wires/us","index":72,"name":"Springs and wires","code":"332600","location":"US","description":"BEA Code \u0026 Name is '332600:Spring and wire product manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in (1) manufacturing steel springs by forming, such as cutting, bending, and heat winding, metal rod or strip stock and/or (2) manufacturing wire springs and fabricated wire products from wire drawn elsewhere (except watch and clock springs)."},{"id":"332710/machine shops/us","index":73,"name":"Machine shops","code":"332710","location":"US","description":"BEA Code \u0026 Name is '332710:Machine shops'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments known as machine shops primarily engaged in machining metal and plastic parts and parts of other composite materials on a job or order basis. Generally machine shop jobs are low volume using machine tools, such as lathes (including computer numerically controlled); automatic screw machines; and machines for boring, grinding, and milling."},{"id":"332720/screws, nuts, and bolts/us","index":74,"name":"Screws, nuts, and bolts","code":"332720","location":"US","description":"BEA Code \u0026 Name is '332720:Turned product and screw, nut, and bolt manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in (1) machining precision turned products or (2) manufacturing metal bolts, nuts, screws, rivets, and other industrial fasteners. Included in this industry are establishments primarily engaged in manufacturing parts for machinery and equipment on a customized basis."},{"id":"332800/metal coatings, engravings, and heat treatments/us","index":75,"name":"Metal coatings, engravings, and heat treatments","code":"332800","location":"US","description":"BEA Code \u0026 Name is '332800:Coating, engraving, heat treating and allied activities'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in one or more of the following: (1) heat treating metals and metal products; (2) enameling, lacquering, and varnishing metals and metal products; (3) hot dip galvanizing metals and metal products; (4) engraving, chasing, or etching metals and metal products (except jewelry; personal goods carried on or about the person, such as compacts and cigarette cases; precious metal products (except precious plated flatware and other plated ware); and printing plates); (5) powder coating metals and metal products; (6) electroplating, plating, anodizing, coloring, and finishing metals and metal products; and (7) providing other metal surfacing services for the trade. Establishments in this industry coat, engrave, and heat treat metals and metal formed products fabricated elsewhere."},{"id":"33291a/valve and fittings (except for plumbing)/us","index":76,"name":"Valve and fittings (except for plumbing)","code":"33291A","location":"US","description":"BEA Code \u0026 Name is '33291A:Valve and fittings other than plumbing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in manufacturing fabricated metal products (except forgings and stampings, cutlery and handtools, architectural and structural metals, boilers, tanks, shipping containers, hardware, spring and wire products, machine shop products, turned products, screws, and nuts and bolts). Related NAICS codes are: 332911-2, 332919"},{"id":"332913/metal plumbing drains, faucets, valves, and other fittings/us","index":77,"name":"Metal plumbing drains, faucets, valves, and other fittings","code":"332913","location":"US","description":"BEA Code \u0026 Name is '332913:Plumbing fixture fitting and trim manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing metal and plastics plumbing fixture fittings and trim, such as faucets, flush valves, and shower heads."},{"id":"332991/ball and roller bearings/us","index":78,"name":"Ball and roller bearings","code":"332991","location":"US","description":"BEA Code \u0026 Name is '332991:Ball and roller bearing manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing ball and roller bearings of all materials."},{"id":"33299a/ammunition, arms, ordnance, and related accessories/us","index":79,"name":"Ammunition, arms, ordnance, and related accessories","code":"33299A","location":"US","description":"BEA Code \u0026 Name is '33299A:Ammunition, arms, ordnance, and accessories manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in manufacturing fabricated metal products (except forgings and stampings, cutlery and handtools, architectural and structural metals, boilers, tanks, shipping containers, hardware, spring and wire products, machine shop products, turned products, screws, and nuts and bolts). Related NAICS codes are: 332992-5"},{"id":"332996/fabricated pipe and pipe fittings/us","index":80,"name":"Fabricated pipe and pipe fittings","code":"332996","location":"US","description":"BEA Code \u0026 Name is '332996:Fabricated pipe and pipe fitting manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in fabricating, such as cutting, threading, and bending metal pipes and pipe fittings made from purchased metal pipe."},{"id":"33299b/metal pipe fittings, ball and roller bearings, industrial patterns, metal bath fixtures, other misc. fabricated metals/us","index":81,"name":"Metal pipe fittings, ball and roller bearings, industrial patterns, metal bath fixtures, other misc. fabricated metals","code":"33299B","location":"US","description":"BEA Code \u0026 Name is '33299B:Other fabricated metal manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in manufacturing fabricated metal products (except forgings and stampings, cutlery and handtools, architectural and structural metals, boilers, tanks, shipping containers, hardware, spring and wire products, machine shop products, turned products, screws, and nuts and bolts). Related NAICS codes are: 332997-9"},{"id":"333111/farm machinery and equipment/us","index":82,"name":"Farm machinery and equipment","code":"333111","location":"US","description":"BEA Code \u0026 Name is '333111:Farm machinery and equipment manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing agricultural and farm machinery and equipment, and other turf and grounds care equipment, including planting, harvesting, and grass mowing equipment (except lawn and garden-type)."},{"id":"333112/lawn and garden equipment/us","index":83,"name":"Lawn and garden equipment","code":"333112","location":"US","description":"BEA Code \u0026 Name is '333112:Lawn and garden equipment manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing powered lawnmowers, lawn and garden tractors, and other home lawn and garden equipment, such as tillers, shredders, yard vacuums, and leaf blowers."},{"id":"333120/construction machinery/us","index":84,"name":"Construction machinery","code":"333120","location":"US","description":"BEA Code \u0026 Name is '333120:Construction machinery manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing construction machinery, surface mining machinery, and logging equipment."},{"id":"333130/mining and oil/gas field machinery/us","index":85,"name":"Mining and oil/gas field machinery","code":"333130","location":"US","description":"BEA Code \u0026 Name is '333130:Mining and oil and gas field machinery manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing oil and gas field and underground mining machinery and equipment."},{"id":"33329a/machinery for the paper, textile, food or other industries (except semiconductor machinery)/us","index":86,"name":"Machinery for the paper, textile, food or other industries (except semiconductor machinery)","code":"33329A","location":"US","description":"BEA Code \u0026 Name is '33329A:Other industrial machinery manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises (1) Sawmill and Woodworking Machinery Manufacturing, (2) Plastics and Rubber Industry Machinery Manufacturing, and (3) Other Industrial Machinery Manufacturing including:  (a) Paper Industry Machinery Manufacturing, (b) Textile Machinery Manufacturing, (c) Printing Machinery and Equipment Manufacturing, (d) Food Product Machinery Manufacturing, (e) Semiconductor Machinery Manufacturing, and (f) All Other Industrial Machinery Manufacturing. Related NAICS codes are: 33321, 333291-4, 333298"},{"id":"333220/plastics and rubber industry machinery/us","index":87,"name":"Plastics and rubber industry machinery","code":"333220","location":"US","description":"BEA Code \u0026 Name is '333220:Plastics and rubber industry machinery manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing plastics and rubber products making machinery, such as plastics compression, extrusion and injection molding machinery and equipment, and tire building and recapping machinery and equipment."},{"id":"333295/semiconductor machinery/us","index":88,"name":"Semiconductor machinery","code":"333295","location":"US","description":"BEA Code \u0026 Name is '333295:Semiconductor machinery manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing wafer processing equipment, semiconductor assembly and packaging equipment, and other semiconductor making machinery."},{"id":"33331a/vending, commercial laundry, and other commercial and service industry machinery/us","index":89,"name":"Vending, commercial laundry, and other commercial and service industry machinery","code":"33331A","location":"US","description":"BEA Code \u0026 Name is '33331A:Vending, commercial laundry, and other commercial and service industry machinery manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing commercial and service machinery, such as automatic vending machinery, commercial laundry and dry-cleaning machinery, office machinery, photographic and photocopying machinery, optical instruments and machinery, automotive maintenance equipment (except mechanics handtools), industrial vacuum cleaners, and commercial-type cooking equipment. Related NAICS codes are: 333311, 333312, 333319"},{"id":"333313/office machinery/us","index":90,"name":"Office machinery","code":"333313","location":"US","description":"BEA Code \u0026 Name is '333313:Office machinery manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing office machinery (except computers and photocopying equipment), such as mailhandling machinery and equipment, calculators, typewriters, and dedicated word processing equipment."},{"id":"333314/optical instruments and lenses/us","index":91,"name":"Optical instruments and lenses","code":"333314","location":"US","description":"BEA Code \u0026 Name is '333314:Optical instrument and lens manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in one or more of the following: (1) manufacturing optical instruments and lens, such as binoculars, microscopes (except electron, proton), telescopes, prisms, and lenses (except ophthalmic); (2) coating or polishing lenses (except ophthalmic); and (3) mounting lenses (except ophthalmic)."},{"id":"333315/photography and photocopying equipment/us","index":92,"name":"Photography and photocopying equipment","code":"333315","location":"US","description":"BEA Code \u0026 Name is '333315:Photographic and photocopying equipment manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing photographic and photocopying equipment, such as cameras (except television, video and digital) projectors, film developing equipment, photocopying equipment, and microfilm equipment."},{"id":"33341a/air purification and ventilation equipment/us","index":93,"name":"Air purification and ventilation equipment","code":"33341A","location":"US","description":"BEA Code \u0026 Name is '33341A:Air purification and ventilation equipment manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing ventilating, heating, air-conditioning, and commercial and industrial refrigeration and freezer equipment. Related NAICS codes are: 333411-2"},{"id":"333414/heating equipment other than warm air furnaces/us","index":94,"name":"Heating equipment other than warm air furnaces","code":"333414","location":"US","description":"BEA Code \u0026 Name is '333414:Heating equipment (except warm air furnaces) manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing heating equipment (except electric and warm air furnaces), such as heating boilers, heating stoves, floor and wall furnaces, and wall and baseboard heating units."},{"id":"333415/air conditioning, refrigeration, and warm air heating equipment/us","index":95,"name":"Air conditioning, refrigeration, and warm air heating equipment","code":"333415","location":"US","description":"BEA Code \u0026 Name is '333415:Air conditioning, refrigeration, and warm air heating equipment manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in (1) manufacturing air-conditioning (except motor vehicle) and warm air furnace equipment and/or (2) manufacturing commercial and industrial refrigeration and freezer equipment."},{"id":"333511/industrial molds/us","index":96,"name":"Industrial molds","code":"333511","location":"US","description":"BEA Code \u0026 Name is '333511:Industrial mold manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing industrial molds for casting metals or forming other materials, such as plastics, glass, or rubber."},{"id":"33351a/metal cutting and forming machine tools/us","index":97,"name":"Metal cutting and forming machine tools","code":"33351A","location":"US","description":"BEA Code \u0026 Name is '33351A:Metal cutting and forming machine tool manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing metalworking machinery, such as metal cutting and metal forming machine tools; cutting tools; and accessories for metalworking machinery; special dies, tools, jigs, and fixtures; industrial molds; rolling mill machinery; assembly machinery; coil handling, conversion, or straightening equipment; and wire drawing and fabricating machines. Related NAICS codes are: 333512-3"},{"id":"333514/special tools, dies, jigs, and fixtures/us","index":98,"name":"Special tools, dies, jigs, and fixtures","code":"333514","location":"US","description":"BEA Code \u0026 Name is '333514:Special tool, die, jig, and fixture manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments, known as tool and die shops, primarily engaged in manufacturing special tools and fixtures, such as cutting dies and jigs."},{"id":"33351b/cutting and machine tool accessory, rolling mill, and other metalworking machines/us","index":99,"name":"Cutting and machine tool accessory, rolling mill, and other metalworking machines","code":"33351B","location":"US","description":"BEA Code \u0026 Name is '33351B:Cutting and machine tool accessory, rolling mill, and other metalworking machinery manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing metalworking machinery, such as metal cutting and metal forming machine tools; cutting tools; and accessories for metalworking machinery; special dies, tools, jigs, and fixtures; industrial molds; rolling mill machinery; assembly machinery; coil handling, conversion, or straightening equipment; and wire drawing and fabricating machines. Related NAICS codes are: 333515, 333516, 333518"},{"id":"333611/turbines and turbine generator sets/us","index":100,"name":"Turbines and turbine generator sets","code":"333611","location":"US","description":"BEA Code \u0026 Name is '333611:Turbine and turbine generator set units manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing turbines (except aircraft); and complete turbine generator set units, such as steam, hydraulic, gas, and wind."},{"id":"333612/speed changers, industrial high-speed drives, and gears/us","index":101,"name":"Speed changers, industrial high-speed drives, and gears","code":"333612","location":"US","description":"BEA Code \u0026 Name is '333612:Speed changer, industrial high-speed drive, and gear manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing gears, speed changers, and industrial high-speed drives (except hydrostatic)."},{"id":"333613/mechanical power transmission equipment/us","index":102,"name":"Mechanical power transmission equipment","code":"333613","location":"US","description":"BEA Code \u0026 Name is '333613:Mechanical power transmission equipment manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing mechanical power transmission equipment (except motor vehicle and aircraft), such as plain bearings, clutches (except motor vehicle and electromagnetic industrial control), couplings, joints, and drive chains."},{"id":"333618/other engine equipment/us","index":103,"name":"Other engine equipment","code":"333618","location":"US","description":"BEA Code \u0026 Name is '333618:Other engine equipment manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing internal combustion engines (except automotive gasoline and aircraft)."},{"id":"33391a/pumps and pumping equipment/us","index":104,"name":"Pumps and pumping equipment","code":"33391A","location":"US","description":"BEA Code \u0026 Name is '33391A:Pump and pumping equipment manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in (1) manufacturing general purpose pumps and pumping equipment (except fluid power pumps and motors), such as reciprocating pumps, turbine pumps, centrifugal pumps, rotary pumps, diaphragm pumps, domestic water system pumps, oil well and oil field pumps and sump pumps; (2) manufacturing measuring and dispensing pumps, such as gasoline pumps and lubricating oil measuring and dispensing pumps. Related NAICS codes are: 333911, 333913"},{"id":"333912/air and gas compressors/us","index":105,"name":"Air and gas compressors","code":"333912","location":"US","description":"BEA Code \u0026 Name is '333912:Air and gas compressor manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing general purpose air and gas compressors, such as reciprocating compressors, centrifugal compressors, vacuum pumps (except laboratory), and nonagricultural spraying and dusting compressors and spray gun units."},{"id":"333920/material handling equipment/us","index":106,"name":"Material handling equipment","code":"333920","location":"US","description":"BEA Code \u0026 Name is '333920:Material handling equipment manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing material handling equipment, such as elevators and moving stairs; conveyors and conveying equipment; overhead traveling cranes, hoists, and monorail systems; and industrial trucks, tractors, trailers, and stacker machinery."},{"id":"333991/power tools/us","index":107,"name":"Power tools","code":"333991","location":"US","description":"BEA Code \u0026 Name is '333991:Power-driven handtool manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing power-driven (e.g., battery, corded, pneumatic) handtools, such as drills, screwguns, circular saws, chain saws, staplers, and nailers."},{"id":"33399a/welding and soldering equipment, scales and balances, and other general purpose machinery/us","index":108,"name":"Welding and Soldering Equipment, Scales and Balances, and other general purpose machinery","code":"33399A","location":"US","description":"BEA Code \u0026 Name is '33399A:Other general purpose machinery manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in (1) manufacturing welding and soldering equipment and accessories (except transformers), such as arc, resistance, gas, plasma, laser, electron beam, and ultrasonic welding equipment; welding electrodes; coated or cored welding wire; and soldering equipment (except handheld); (2) manufacturing scales and balances, including those used in laboratories; and (3) manufacturing general purpose machinery (except ventilating, heating, air-conditioning, and commercial refrigeration equipment; metal working machinery; engines, turbines, and power transmission equipment; pumps and compressors; material handling equipment; power-driven handtools; welding and soldering equipment; packaging machinery; industrial process furnaces and ovens; fluid power cylinders and actuators; fluid power pumps and motors; and scales and balances). Related NAICS codes are: 333992, 333997, 333999"},{"id":"333993/packaging machinery/us","index":109,"name":"Packaging machinery","code":"333993","location":"US","description":"BEA Code \u0026 Name is '333993:Packaging machinery manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing packaging machinery, such as wrapping, bottling, canning, and labeling machinery."},{"id":"333994/industrial process furnaces and ovens/us","index":110,"name":"Industrial process furnaces and ovens","code":"333994","location":"US","description":"BEA Code \u0026 Name is '333994:Industrial process furnace and oven manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. Industry comprises establishments primarily engaged in manufacturing industrial process ovens, induction and dielectric heating equipment, and kilns (except cement, chemical, wood). Included in this industry are establishments manufacturing laboratory furnaces and ovens."},{"id":"33399b/hydraulic pumps, motors, cylinders and actuators/us","index":111,"name":"Hydraulic pumps, motors, cylinders and actuators","code":"33399B","location":"US","description":"BEA Code \u0026 Name is '33399B:Fluid power process machinery'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in (1) manufacturing fluid power (i.e., hydraulic and pneumatic) cylinders and actuators, and (2) manufacturing fluid power (i.e., hydraulic and pneumatic) pumps and motors. Related NAICS codes are: 333995-6"},{"id":"334111/computers/us","index":112,"name":"Computers","code":"334111","location":"US","description":"BEA Code \u0026 Name is '334111:Electronic computer manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing and/or assembling electronic computers, such as mainframes, personal computers, workstations, laptops, and computer servers. Computers can be analog, digital, or hybrid. Digital computers, the most common type, are devices that do all of the following: (1) store the processing program or programs and the data immediately necessary for the execution of the program; (2) can be freely programmed in accordance with the requirements of the user; (3) perform arithmetical computations specified by the user; and (4) execute, without human intervention, a processing program that requires the computer to modify its execution by logical decision during the processing run. Analog computers are capable of simulating mathematical models and contain at least analog, control, and programming elements. The manufacture of computers includes the assembly or integration of processors, coprocessors, memory, storage, and input/output devices into a user-programmable final product."},{"id":"334112/computer storage device readers/us","index":113,"name":"Computer storage device readers","code":"334112","location":"US","description":"BEA Code \u0026 Name is '334112:Computer storage device manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing computer storage devices that allow the storage and retrieval of data from a phase change, magnetic, optical, or magnetic/optical media. Examples of products made by these establishments are CD-ROM drives, floppy disk drives, hard disk drives, and tape storage and backup units."},{"id":"33411a/computer terminals and other computer peripheral equipment/us","index":114,"name":"Computer terminals and other computer peripheral equipment","code":"33411A","location":"US","description":"BEA Code \u0026 Name is '33411A:Computer terminals and other computer peripheral equipment manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing and/or assembling electronic computers, such as mainframes, personal computers, workstations, laptops, and computer servers; and computer peripheral equipment, such as storage devices, printers, monitors, input/output devices and terminals. Computers can be analog, digital, or hybrid. Digital computers, the most common type, are devices that do all of the following: (1) store the processing program or programs and the data immediately necessary for the execution of the program; (2) can be freely programmed in accordance with the requirements of the user; (3) perform arithmetical computations specified by the user; and (4) execute, without human intervention, a processing program that requires the computer to modify its execution by logical decision during the processing run. Analog computers are capable of simulating mathematical models and comprise at least analog, control, and programming elements. Related NAICS codes are: 334113, 334119"},{"id":"334210/telephones/us","index":115,"name":"Telephones","code":"334210","location":"US","description":"BEA Code \u0026 Name is '334210:Telephone apparatus manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing wire telephone and data communications equipment. These products may be standalone or board-level components of a larger system. Examples of products made by these establishments are central office switching equipment, cordless telephones (except cellular), PBX equipment, telephones, telephone answering machines, LAN modems, multi-user modems, and other data communications equipment, such as bridges, routers, and gateways."},{"id":"334220/wireless communications/us","index":116,"name":"Wireless communications","code":"334220","location":"US","description":"BEA Code \u0026 Name is '334220:Broadcast and wireless communications equipment'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing radio and television broadcast and wireless communications equipment. Examples of products made by these establishments are: transmitting and receiving antennas, cable television equipment, GPS equipment, pagers, cellular phones, mobile communications equipment, and radio and television studio and broadcasting equipment."},{"id":"334290/communications equipment/us","index":117,"name":"Communications equipment","code":"334290","location":"US","description":"BEA Code \u0026 Name is '334290:Other communications equipment manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing communications equipment (except telephone apparatus, and radio and television broadcast, and wireless communications equipment)."},{"id":"334300/audio and video equipment/us","index":118,"name":"Audio and video equipment","code":"334300","location":"US","description":"BEA Code \u0026 Name is '334300:Audio and video equipment manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing electronic audio and video equipment for home entertainment, motor vehicles, and public address and musical instrument amplification. Examples of products made by these establishments are video cassette recorders, televisions, stereo equipment, speaker systems, household-type video cameras, jukeboxes, and amplifiers for musical instruments and public address systems."},{"id":"33441a/electronic capacitors, resistors, coils, transformers, connectors and other components (except  semiconductors and printed circuit assemblies)/us","index":119,"name":"Electronic capacitors, resistors, coils, transformers, connectors and other components (except  semiconductors and printed circuit assemblies)","code":"33441A","location":"US","description":"BEA Code \u0026 Name is '33441A:Other electronic component manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing semiconductors and other components for electronic applications. Examples of products made by these establishments are capacitors, resistors, microprocessors, bare and loaded printed circuit boards, electron tubes, electronic connectors, and computer modems. Related NAICS codes are: 334411, 334412, 334414-7, 334419"},{"id":"334413/semiconductors/us","index":120,"name":"Semiconductors","code":"334413","location":"US","description":"BEA Code \u0026 Name is '334413:Semiconductor and related device manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing semiconductors and related solid state devices. Examples of products made by these establishments are integrated circuits, memory chips, microprocessors, diodes, transistors, solar cells and other optoelectronic devices."},{"id":"334418/printed circuit and electronic assembly/us","index":121,"name":"Printed circuit and electronic assembly","code":"334418","location":"US","description":"BEA Code \u0026 Name is '334418:Printed circuit assembly (electronic assembly) manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in loading components onto printed circuit boards or who manufacture and ship loaded printed circuit boards. Also known as printed circuit assemblies, electronics assemblies, or modules, these products are printed circuit boards that have some or all of the semiconductor and electronic components inserted or mounted and are inputs to a wide variety of electronic systems and devices."},{"id":"334510/electromedical appartuses/us","index":122,"name":"Electromedical appartuses","code":"334510","location":"US","description":"BEA Code \u0026 Name is '334510:Electromedical and electrotherapeutic apparatus manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing electromedical and electrotherapeutic apparatus, such as magnetic resonance imaging equipment, medical ultrasound equipment, pacemakers, hearing aids, electrocardiographs, and electromedical endoscopic equipment."},{"id":"334511/navigation instruments/us","index":123,"name":"Navigation instruments","code":"334511","location":"US","description":"BEA Code \u0026 Name is '334511:Search, detection, and navigation instruments manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing search, detection, navigation, guidance, aeronautical, and nautical systems and instruments. Examples of products made by these establishments are aircraft instruments (except engine), flight recorders, navigational instruments and systems, radar systems and equipment, and sonar systems and equipment."},{"id":"334512/automatic controls for hvac and refrigeration equipment/us","index":124,"name":"Automatic controls for HVAC and refrigeration equipment","code":"334512","location":"US","description":"BEA Code \u0026 Name is '334512:Automatic environmental control manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing automatic controls and regulators for applications, such as heating, air-conditioning, refrigeration and appliances."},{"id":"334513/industrial process variable instruments/us","index":125,"name":"Industrial process variable instruments","code":"334513","location":"US","description":"BEA Code \u0026 Name is '334513:Industrial process variable instruments manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing instruments and related devices for measuring, displaying, indicating, recording, transmitting, and controlling industrial process variables. These instruments measure, display or control (monitor, analyze, and so forth) industrial process variables, such as temperature, humidity, pressure, vacuum, combustion, flow, level, viscosity, density, acidity, concentration, and rotation."},{"id":"334514/fluid meters and counting devices/us","index":126,"name":"Fluid meters and counting devices","code":"334514","location":"US","description":"BEA Code \u0026 Name is '334514:Totalizing fluid meter and counting device manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing totalizing (i.e., registering) fluid meters and counting devices. Examples of products made by these establishments are gas consumption meters, water consumption meters, parking meters, taxi meters, motor vehicle gauges, and fare collection equipment."},{"id":"334515/signal testing instruments/us","index":127,"name":"Signal testing instruments","code":"334515","location":"US","description":"BEA Code \u0026 Name is '334515:Electricity and signal testing instruments manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing instruments for measuring and testing the characteristics of electricity and electrical signals. Examples of products made by these establishments are circuit and continuity testers, voltmeters, ohm meters, wattmeters, multimeters, and semiconductor test equipment."},{"id":"334516/analytical laboratory instruments/us","index":128,"name":"Analytical laboratory instruments","code":"334516","location":"US","description":"BEA Code \u0026 Name is '334516:Analytical laboratory instrument manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing instruments and instrumentation systems for laboratory analysis of the chemical or physical composition or concentration of samples of solid, fluid, gaseous, or composite material."},{"id":"334517/irradiation apparatuses/us","index":129,"name":"Irradiation apparatuses","code":"334517","location":"US","description":"BEA Code \u0026 Name is '334517:Irradiation apparatus manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing irradiation apparatus and tubes for applications, such as medical diagnostic, medical therapeutic, industrial, research and scientific evaluation. Irradiation can take the form of beta-rays, gamma-rays, X-rays, or other ionizing radiation."},{"id":"33451a/watches, clocks, and other measuring and controlling devices/us","index":130,"name":"Watches, clocks, and other measuring and controlling devices","code":"33451A","location":"US","description":"BEA Code \u0026 Name is '33451A:Watch, clock, and other measuring and controlling device manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing navigational, measuring, electromedical, and control instruments. Examples of products made by these establishments are aeronautical instruments, appliance regulators and controls (except switches), laboratory analytical instruments, navigation and guidance systems, and physical properties testing equipment. Related NAICS codes are: 334518-9"},{"id":"334610/external hard drives, cds, other storage media/us","index":131,"name":"External hard drives, CDs, other storage media","code":"334610","location":"US","description":"BEA Code \u0026 Name is '334610:Manufacturing and reproducing magnetic and optical media'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in (1) manufacturing optical and magnetic media, such as blank audio tape, blank video tape, and blank diskettes and/or (2) mass duplicating (i.e., making copies) audio, video, software, and other data on magnetic, optical, and similar media."},{"id":"335110/light bulbs/us","index":132,"name":"Light bulbs","code":"335110","location":"US","description":"BEA Code \u0026 Name is '335110:Electric lamp bulb and part manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing electric light bulbs and tubes, and parts and components (except glass blanks for electric light bulbs)."},{"id":"335120/light fixtures/us","index":133,"name":"Light fixtures","code":"335120","location":"US","description":"BEA Code \u0026 Name is '335120:Lighting fixture manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing electric lighting fixtures (except vehicular), nonelectric lighting equipment, lamp shades (except glass and plastics), and lighting fixture components (except current-carrying wiring devices)."},{"id":"335210/small electrical appliances/us","index":134,"name":"Small electrical appliances","code":"335210","location":"US","description":"BEA Code \u0026 Name is '335210:Small electrical appliance manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing small electric appliances and electric housewares, household-type fans, household-type vacuum cleaners, and other electric householdtype floor care machines."},{"id":"335221/home cooking appliances/us","index":135,"name":"Home cooking appliances","code":"335221","location":"US","description":"BEA Code \u0026 Name is '335221:Household cooking appliance manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing household-type electric and nonelectric cooking equipment (except small electric appliances and electric housewares)."},{"id":"335222/home refrigerators and freezers/us","index":136,"name":"Home refrigerators and freezers","code":"335222","location":"US","description":"BEA Code \u0026 Name is '335222:Household refrigerator and home freezer manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing household-type refrigerators and upright and chest freezers."},{"id":"335224/home laundry machines/us","index":137,"name":"Home laundry machines","code":"335224","location":"US","description":"BEA Code \u0026 Name is '335224:Household laundry equipment manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing household-type laundry equipment."},{"id":"335228/major home appliances (except ovens, stoves, refrigerators and laundry machines)/us","index":138,"name":"Major home appliances (except ovens, stoves, refrigerators and laundry machines)","code":"335228","location":"US","description":"BEA Code \u0026 Name is '335228:Other major household appliance manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing electric and nonelectric major household-type appliances (except cooking equipment, refrigerators, upright and chest freezers, and household-type laundry equipment."},{"id":"335311/specialty transformers/us","index":139,"name":"Specialty transformers","code":"335311","location":"US","description":"BEA Code \u0026 Name is '335311:Power, distribution, and specialty transformer manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing power, distribution, and specialty transformers (except electronic components). Industrial-type and consumer-type transformers in this industry vary (e.g., step up or step down) voltage but do not convert alternating to direct or direct to alternating current."},{"id":"335312/motors and generators/us","index":140,"name":"Motors and generators","code":"335312","location":"US","description":"BEA Code \u0026 Name is '335312:Motor and generator manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing electric motors (except internal combustion engine starting motors), power generators (except battery charging alternators for internal combustion engines), and motor generator sets (except turbine generator set units). This industry includes establishments rewinding armatures on a factory basis."},{"id":"335313/switchgear and switchboards/us","index":141,"name":"Switchgear and switchboards","code":"335313","location":"US","description":"BEA Code \u0026 Name is '335313:Switchgear and switchboard apparatus manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing switchgear and switchboard apparatus."},{"id":"335314/relay and industrial controls/us","index":142,"name":"Relay and industrial controls","code":"335314","location":"US","description":"BEA Code \u0026 Name is '335314:Relay and industrial control manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing relays, motor starters and controllers, and other industrial controls and control accessories."},{"id":"335911/storage batteries/us","index":143,"name":"Storage batteries","code":"335911","location":"US","description":"BEA Code \u0026 Name is '335911:Storage battery manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing storage batteries."},{"id":"335912/primary batteries/us","index":144,"name":"Primary batteries","code":"335912","location":"US","description":"BEA Code \u0026 Name is '335912:Primary battery manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing wet or dry primary batteries."},{"id":"335920/communication and energy wire and cable/us","index":145,"name":"Communication and energy wire and cable","code":"335920","location":"US","description":"BEA Code \u0026 Name is '335920:Communication and energy wire and cable manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments insulating fiber-optic cable, and manufacturing insulated nonferrous wire and cable from nonferrous wire drawn in other establishments."},{"id":"335930/wiring devices/us","index":146,"name":"Wiring devices","code":"335930","location":"US","description":"BEA Code \u0026 Name is '335930:Wiring device manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing current-carrying wiring devices and noncurrent-carrying wiring devices for wiring electrical circuits."},{"id":"335991/carbon and graphite products/us","index":147,"name":"Carbon and graphite products","code":"335991","location":"US","description":"BEA Code \u0026 Name is '335991:Carbon and graphite product manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing carbon, graphite, and metal-graphite brushes and brush stock; carbon or graphite electrodes for thermal and electrolytic uses; carbon and graphite fibers; and other carbon, graphite, and metal-graphite products."},{"id":"335999/other miscellaneous electrical equipment and components/us","index":148,"name":"other miscellaneous electrical equipment and components","code":"335999","location":"US","description":"BEA Code \u0026 Name is '335999:All other miscellaneous electrical equipment and component manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing industrial and commercial electric apparatus and other equipment (except lighting equipment, household appliances, transformers, motors, generators, switchgear, relays, industrial controls, batteries, communication and energy wire and cable, wiring devices, and carbon and graphite products). This industry includes power converters (i.e., AC to DC and DC to AC), power supplies, surge suppressors, and similar equipment for industrial-type and consumer-type equipment."},{"id":"336111/automobiles/us","index":149,"name":"Automobiles","code":"336111","location":"US","description":"BEA Code \u0026 Name is '336111:Automobile manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in (1) manufacturing complete automobiles (i.e., body and chassis or unibody) or (2) manufacturing automobile chassis only."},{"id":"336112/pickup trucks, vans, and suvs/us","index":150,"name":"Pickup trucks, vans, and SUVs","code":"336112","location":"US","description":"BEA Code \u0026 Name is '336112:Light truck and utility vehicle manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in (1) manufacturing complete light trucks and utility vehicles (i.e., body and chassis) or (2) manufacturing light truck and utility vehicle chassis only. Vehicles made include light duty vans, pick-up trucks, minivans, and sport utility vehicles."},{"id":"336120/heavy duty trucks/us","index":151,"name":"Heavy duty trucks","code":"336120","location":"US","description":"BEA Code \u0026 Name is '336120:Heavy duty truck manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in (1) manufacturing heavy duty truck chassis and assembling complete heavy duty trucks, buses, heavy duty motor homes, and other special purpose heavy duty motor vehicles for highway use or (2) manufacturing heavy duty truck chassis only."},{"id":"336211/vehicle bodies/us","index":152,"name":"Vehicle bodies","code":"336211","location":"US","description":"BEA Code \u0026 Name is '336211:Motor vehicle body manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing truck and bus bodies and cabs and automobile bodies. The products made may be sold separately or may be assembled on purchased chassis and sold as complete vehicles."},{"id":"336212/truck trailers/us","index":153,"name":"Truck trailers","code":"336212","location":"US","description":"BEA Code \u0026 Name is '336212:Truck trailer manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing truck trailers, truck trailer chassis, cargo container chassis, detachable trailer bodies, and detachable trailer chassis for sale separately."},{"id":"336213/motor homes/us","index":154,"name":"Motor homes","code":"336213","location":"US","description":"BEA Code \u0026 Name is '336213:Motor home manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in (1) manufacturing motor homes on purchased chassis and/or (2) manufacturing conversion vans on an assembly line basis. Motor homes are units where the motor and the living quarters are integrated in the same unit."},{"id":"336214/travel trailer and campers/us","index":155,"name":"Travel trailer and campers","code":"336214","location":"US","description":"BEA Code \u0026 Name is '336214:Travel trailer and camper manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in one or more of the following: (1) manufacturing travel trailers and campers designed to attach to motor vehicles; (2) manufacturing pickup coaches (i.e., campers) and caps (i.e., covers) for mounting on pickup trucks; and (3) manufacturing automobile, utility and light-truck trailers. Travel trailers do not have their own motor but are designed to be towed by a motor unit, such as an automobile or a light truck."},{"id":"336310/vehicle engines and engine parts/us","index":156,"name":"Vehicle engines and engine parts","code":"336310","location":"US","description":"BEA Code \u0026 Name is '336310:Motor vehicle gasoline engine and engine parts manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing and/or rebuilding motor vehicle gasoline engines, and engine parts, whether or not for vehicular use."},{"id":"336320/vehicle electrical and electronic equipment/us","index":157,"name":"Vehicle electrical and electronic equipment","code":"336320","location":"US","description":"BEA Code \u0026 Name is '336320:Motor vehicle electrical and electronic equipment manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in (1) manufacturing vehicular lighting and/or (2) manufacturing and/or rebuilding motor vehicle electrical and electronic equipment. The products made can be used for all types of transportation equipment (i.e., aircraft, automobiles, trains, ships)."},{"id":"3363a0/motor vehicle steering, suspension components (except spring), and brake systems/us","index":158,"name":"Motor vehicle steering, suspension components (except spring), and brake systems","code":"3363A0","location":"US","description":"BEA Code \u0026 Name is '3363A0:Motor vehicle steering, suspension component (except spring), and brake systems manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises (1) Motor Vehicle Gasoline Engine and Engine Parts Manufacturing, (2) Motor Vehicle Electrical and Electronic Equipment Manufacturing, (3) Motor Vehicle Steering and Suspension Components (except Spring) Manufacturing, (4) Motor Vehicle Brake System Manufacturing, (5) Motor Vehicle Transmission and Power Train Parts Manufacturing, (6) Motor Vehicle Seating and Interior Trim Manufacturing, (7) Motor Vehicle Metal Stamping, and (8) Other Motor Vehicle Parts Manufacturing including:  (a) Motor Vehicle Air-Conditioning Manufacturing, and (b) All Other Motor Vehicle Parts Manufacturing Related NAICS codes are: 33633-4"},{"id":"336350/transmission and power train parts/us","index":159,"name":"Transmission and power train parts","code":"336350","location":"US","description":"BEA Code \u0026 Name is '336350:Motor vehicle transmission and power train parts manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing and/or rebuilding motor vehicle transmissions and power train parts."},{"id":"336360/vehicle seating and interior trim (upholstery)/us","index":160,"name":"Vehicle seating and interior trim (upholstery)","code":"336360","location":"US","description":"BEA Code \u0026 Name is '336360:Motor vehicle seating and interior trim manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing motor vehicle seating, seats, seat frames, seat belts, and interior trimmings."},{"id":"336370/vehicle metal stamping/us","index":161,"name":"Vehicle metal stamping","code":"336370","location":"US","description":"BEA Code \u0026 Name is '336370:Motor vehicle metal stamping'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing motor vehicle stampings, such as fenders, tops, body parts, trim, and molding."},{"id":"336390/other vehicle parts/us","index":162,"name":"Other vehicle parts","code":"336390","location":"US","description":"BEA Code \u0026 Name is '336390:Other motor vehicle parts manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing and/or rebuilding motor vehicle parts and accessories (except motor vehicle gasoline engines and engine parts, motor vehicle electrical and electronic equipment, motor vehicle steering and suspension components, motor vehicle brake systems, motor vehicle transmissions and power train parts, motor vehicle seating and interior trim, and motor vehicle stampings)."},{"id":"336411/aircraft/us","index":163,"name":"Aircraft","code":"336411","location":"US","description":"BEA Code \u0026 Name is '336411:Aircraft manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in one or more of the following: (1) manufacturing or assembling complete aircraft; (2) developing and making aircraft prototypes; (3) aircraft conversion (i.e., major modifications to systems); and (4) complete aircraft overhaul and rebuilding (i.e., periodic restoration of aircraft to original design specifications)."},{"id":"336412/aircraft engines and parts/us","index":164,"name":"Aircraft engines and parts","code":"336412","location":"US","description":"BEA Code \u0026 Name is '336412:Aircraft engine and engine parts manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in one or more of the following: (1) manufacturing aircraft engines and engine parts; (2) developing and making prototypes of aircraft engines and engine parts; (3) aircraft propulsion system conversion (i.e., major modifications to systems); and (4) aircraft propulsion systems overhaul and rebuilding (i.e., periodic restoration of aircraft propulsion system to original design specifications)."},{"id":"336413/other aircraft parts/us","index":165,"name":"Other aircraft parts","code":"336413","location":"US","description":"BEA Code \u0026 Name is '336413:Other aircraft parts and auxiliary equipment manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishment primarily engaged in (1) manufacturing aircraft parts or auxiliary equipment (except engines and aircraft fluid power subassemblies) and/or (2) developing and making prototypes of aircraft parts and auxiliary equipment. Auxiliary equipment includes such items as crop dusting apparatus, armament racks, inflight refueling equipment, and external fuel tanks."},{"id":"336414/guided missiles and space vehicles/us","index":166,"name":"Guided missiles and space vehicles","code":"336414","location":"US","description":"BEA Code \u0026 Name is '336414:Guided missile and space vehicle manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in (1) manufacturing complete guided missiles and space vehicles and/or (2) developing and making prototypes of guided missiles or space vehicles."},{"id":"33641a/propulsion units and parts for space vehicles and guided missiles/us","index":167,"name":"Propulsion units and parts for space vehicles and guided missiles","code":"33641A","location":"US","description":"BEA Code \u0026 Name is '33641A:Propulsion units and parts for space vehicles and guided missiles'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in one or more of the following: (1) manufacturing complete aircraft, missiles, or space vehicles; (2) manufacturing aerospace engines, propulsion units, auxiliary equipment or parts; (3) developing and making prototypes of aerospace products; (4) aircraft conversion (i.e., major modifications to systems); and (5) complete aircraft or propulsion systems overhaul and rebuilding (i.e., periodic restoration of aircraft to original design specifications). Related NAICS codes are: 336415, 336419"},{"id":"336500/railroad rolling stock/us","index":168,"name":"Railroad rolling stock","code":"336500","location":"US","description":"BEA Code \u0026 Name is '336500:Railroad rolling stock manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in one or more of the following: (1) manufacturing and/or rebuilding locomotives, locomotive frames and parts; (2) manufacturing railroad, street, and rapid transit cars and car equipment for operation on rails for freight and passenger service; and (3) manufacturing rail layers, ballast distributors, rail tamping equipment and other railway track maintenance equipment."},{"id":"336611/ships and ship repair/us","index":169,"name":"Ships and ship repair","code":"336611","location":"US","description":"BEA Code \u0026 Name is '336611:Ship building and repairing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in operating a shipyard. Shipyards are fixed facilities with drydocks and fabrication equipment capable of building a ship, defined as watercraft typically suitable or intended for other than personal or recreational use. Activities of shipyards include the construction of ships, their repair, conversion and alteration, the production of prefabricated ship and barge sections, and specialized services, such as ship scaling."},{"id":"336612/boats/us","index":170,"name":"Boats","code":"336612","location":"US","description":"BEA Code \u0026 Name is '336612:Boat building'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in building boats. Boats are defined as watercraft not built in shipyards and typically of the type suitable or intended for personal use. Included in this industry are establishments that manufacture heavy-duty inflatable rubber or inflatable plastic boats (RIBs)."},{"id":"336991/motorcycle, bicycle, and parts/us","index":171,"name":"Motorcycle, bicycle, and parts","code":"336991","location":"US","description":"BEA Code \u0026 Name is '336991:Motorcycle, bicycle, and parts manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing motorcycles, bicycles, tricycles and similar equipment, and parts."},{"id":"336992/military armored vehicles and tanks/us","index":172,"name":"Military armored vehicles and tanks","code":"336992","location":"US","description":"BEA Code \u0026 Name is '336992:Military armored vehicle, tank, and tank component manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing complete military armored vehicles, combat tanks, specialized components for combat tanks, and self-propelled weapons."},{"id":"336999/other transportation equipment/us","index":173,"name":"Other transportation equipment","code":"336999","location":"US","description":"BEA Code \u0026 Name is '336999:All other transportation equipment manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing transportation equipment (except motor vehicles, motor vehicle parts, boats, ships, railroad rolling stock, aerospace products, motorcycles, bicycles, armored vehicles and tanks)."},{"id":"337110/wood kitchen cabinets and countertops/us","index":174,"name":"Wood kitchen cabinets and countertops","code":"337110","location":"US","description":"BEA Code \u0026 Name is '337110:Wood kitchen cabinet and countertop manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing wood or plastics laminated on wood kitchen cabinets, bathroom vanities, and countertops (except freestanding). The cabinets and counters may be made on a stock or custom basis."},{"id":"337121/home furniture - upholstered/us","index":175,"name":"Home furniture - upholstered","code":"337121","location":"US","description":"BEA Code \u0026 Name is '337121:Upholstered household furniture manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing upholstered householdtype furniture. The furniture may be made on a stock or custom basis."},{"id":"337122/home furniture - wood, nonupholstered/us","index":176,"name":"Home furniture - wood, nonupholstered","code":"337122","location":"US","description":"BEA Code \u0026 Name is '337122:Nonupholstered wood household furniture manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing nonupholstered wood household-type furniture and freestanding cabinets (except television, radio, and sewing machine cabinets). The furniture may be made on a stock or custom basis and may be assembled or unassembled (i.e., knockdown)."},{"id":"33712a/home furniture - cabinets and non-wood, nonupholstered/us","index":177,"name":"Home furniture - Cabinets and non-wood, nonupholstered","code":"33712A","location":"US","description":"BEA Code \u0026 Name is '33712A:Other household nonupholstered furniture'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments manufacturing household-type furniture, such as living room, kitchen and bedroom furniture and institutional (i.e., public building) furniture, such as furniture for schools, theaters, and churches. Related NAICS codes are: 337124, 337125, 337129"},{"id":"337127/institutional furniture/us","index":178,"name":"Institutional furniture","code":"337127","location":"US","description":"BEA Code \u0026 Name is '337127:Institutional furniture manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing institutional-type furniture (e.g., library, school, theater, and church furniture). Included in this industry are establishments primarily engaged in manufacturing general purpose hospital, laboratory, and dental furniture (e.g., tables, stools, and benches). The furniture may be made on a stock or custom basis and may be assembled or unassembled (i.e., knockdown)."},{"id":"33721a/office furniture and custom architectural woodwork and millwork/us","index":179,"name":"Office furniture and custom architectural woodwork and millwork","code":"33721A","location":"US","description":"BEA Code \u0026 Name is '33721A:Office furniture and custom architectural woodwork and millwork manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing office furniture and/or office and store fixtures. The furniture may be made on a stock or custom basis and may be assembled or unassembled (i.e., knockdown). Related NAICS codes are: 337211, 337212, 337214"},{"id":"337215/shelving and lockers/us","index":180,"name":"Shelving and lockers","code":"337215","location":"US","description":"BEA Code \u0026 Name is '337215:Showcase, partition, shelving, and locker manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing office furniture and/or office and store fixtures. The furniture may be made on a stock or custom basis and may be assembled or unassembled (i.e., knockdown)."},{"id":"337900/mattresses, blinds and shades/us","index":181,"name":"Mattresses, blinds and shades","code":"337900","location":"US","description":"BEA Code \u0026 Name is '337900:Other furniture related product manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments manufacturing furniture related products, such as mattresses, blinds, and shades."},{"id":"339112/surgical and medical instruments/us","index":182,"name":"Surgical and medical instruments","code":"339112","location":"US","description":"BEA Code \u0026 Name is '339112:Surgical and medical instrument manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing medical, surgical, ophthalmic, and veterinary instruments and apparatus (except electrotherapeutic, electromedical and irradiation apparatus). Examples of products made by these establishments are syringes, hypodermic needles, anesthesia apparatus, blood transfusion equipment, catheters, surgical clamps, and medical thermometers."},{"id":"339113/surgical appliance and supplies/us","index":183,"name":"Surgical appliance and supplies","code":"339113","location":"US","description":"BEA Code \u0026 Name is '339113:Surgical appliance and supplies manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing surgical appliances and supplies. Examples of products made by these establishments are orthopedic devices, prosthetic appliances, surgical dressings, crutches, surgical sutures, personal industrial safety devices (except protective eyewear), hospital beds, and operating room tables."},{"id":"339114/dental equipment and supplies/us","index":184,"name":"Dental equipment and supplies","code":"339114","location":"US","description":"BEA Code \u0026 Name is '339114:Dental equipment and supplies manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing dental equipment and supplies used by dental laboratories and offices of dentists, such as dental chairs, dental instrument delivery systems, dental hand instruments, and dental impression material and dental cements."},{"id":"339115/ophthalmic goods/us","index":185,"name":"Ophthalmic goods","code":"339115","location":"US","description":"BEA Code \u0026 Name is '339115:Ophthalmic goods manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing ophthalmic goods. Examples of products made by these establishments are prescription eyeglasses (except manufactured in a retail setting), contact lenses, sunglasses, eyeglass frames, and reading glasses made to standard powers, and protective eyewear."},{"id":"339116/dental laboratories/us","index":186,"name":"Dental laboratories","code":"339116","location":"US","description":"BEA Code \u0026 Name is '339116:Dental laboratories'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing dentures, crowns, bridges, and orthodontic appliances customized for individual application."},{"id":"339910/jewelry and silverware/us","index":187,"name":"Jewelry and silverware","code":"339910","location":"US","description":"BEA Code \u0026 Name is '339910:Jewelry and silverware manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in one or more of the following: (1) manufacturing, engraving, chasing, or etching jewelry; (2) manufacturing metal personal goods (i.e., small articles carried on or about the person, such as compacts or cigarette cases); (3) manufacturing, engraving, chasing, or etching precious metal solid, precious metal clad, or pewter cutlery and flatware; (4) manufacturing, engraving, chasing, or etching personal metal goods (i.e., small articles carried on or about the person, such as compacts or cigarette cases); (5) stamping coins; (6) manufacturing unassembled jewelry parts and stock shop products, such as sheet, wire, and tubing; (7) cutting, slabbing, tumbling, carving, engraving, polishing, or faceting precious or semiprecious stones and gems; (8) recutting, repolishing, and setting gem stones; and (9) drilling, sawing, and peeling cultured and costume pearls."},{"id":"339920/sporting and athletic goods/us","index":188,"name":"Sporting and athletic goods","code":"339920","location":"US","description":"BEA Code \u0026 Name is '339920:Sporting and athletic goods manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing sporting and athletic goods (except apparel and footwear)."},{"id":"339930/dolls, toys, and games/us","index":189,"name":"Dolls, toys, and games","code":"339930","location":"US","description":"BEA Code \u0026 Name is '339930:Doll, toy, and game manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing dolls, toys, and games, such as complete dolls, doll parts, doll clothes, action figures, toys, games (including electronic), hobby kits, and children's vehicles (except metal bicycles and tricycles)."},{"id":"339940/office supplies (not paper)/us","index":190,"name":"Office supplies (not paper)","code":"339940","location":"US","description":"BEA Code \u0026 Name is '339940:Office supplies (except paper) manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing office supplies. Examples of products made by these establishments are pens, pencils, felt tip markers, crayons, chalk, pencil sharpeners, staplers, hand operated stamps, modeling clay, and inked ribbons."},{"id":"339950/signs/us","index":191,"name":"Signs","code":"339950","location":"US","description":"BEA Code \u0026 Name is '339950:Sign manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing signs and related displays of all materials (except printing paper and paperboard signs, notices, displays)."},{"id":"339990/gaskets, seals, musical instruments, fasteners, brooms, brushes, mop and other misc. goods/us","index":192,"name":"Gaskets, seals, musical instruments, fasteners, brooms, brushes, mop and other misc. goods","code":"339990","location":"US","description":"BEA Code \u0026 Name is '339990:All other miscellaneous manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in miscellaneous manufacturing (except medical equipment and supplies, jewelry and flatware, sporting and athletic goods, dolls, toys, games, office supplies (except paper), and signs)."},{"id":"311111/dog and cat food/us","index":193,"name":"Dog and cat food","code":"311111","location":"US","description":"BEA Code \u0026 Name is '311111:Dog and cat food manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing dog and cat food from ingredients, such as grains, oilseed mill products, and meat products."},{"id":"311119/other animal food/us","index":194,"name":"Other animal food","code":"311119","location":"US","description":"BEA Code \u0026 Name is '311119:Other animal food manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing animal food (except dog and cat) from ingredients, such as grains, oilseed mill products, and meat products."},{"id":"311210/flours and malts/us","index":195,"name":"Flours and malts","code":"311210","location":"US","description":"BEA Code \u0026 Name is '311210:Flour milling and malt manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in one or more of the following: (1) milling flour or meal from grains or vegetables; (2) preparing flour mixes or doughs from flour milled in the same establishment; (3) milling, cleaning, and polishing rice; and (4) manufacturing malt from barley, rye, or other grains."},{"id":"311221/corn products/us","index":196,"name":"Corn products","code":"311221","location":"US","description":"BEA Code \u0026 Name is '311221:Wet corn milling'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in wet milling corn and other vegetables (except to make ethyl alcohol). Examples of products made in these establishments are corn sweeteners, such as glucose, dextrose, and fructose; corn oil; and starches (except laundry)."},{"id":"31122a/vegetable oils and by-products/us","index":197,"name":"Vegetable oils and by-products","code":"31122A","location":"US","description":"BEA Code \u0026 Name is '31122A:Soybean and other oilseed processing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in crushing oilseeds and tree nuts, such as soybeans, cottonseeds, linseeds, peanuts, and sunflower seeds. Examples of products produced in these establishments are oilseed oils, cakes, meals, and protein isolates and concentrates. Related NAICS codes are: 311222-3, *311224: Soybean and Other Oilseed Processing"},{"id":"311225/refined vegetable, olive, and seed oils/us","index":198,"name":"Refined vegetable, olive, and seed oils","code":"311225","location":"US","description":"BEA Code \u0026 Name is '311225:Fats and oils refining and blending'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in one or more of the following: (1) manufacturing shortening and margarine from purchased fats and oils; (2) refining and/or blending vegetable, oilseed, and tree nut oils from purchased oils; and (3) blending purchased animal fats with purchased vegetable fats."},{"id":"311230/breakfast cereals/us","index":199,"name":"Breakfast cereals","code":"311230","location":"US","description":"BEA Code \u0026 Name is '311230:Breakfast cereal manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing breakfast cereal foods."},{"id":"311300/sugar, candy, and chocolate/us","index":200,"name":"Sugar, candy, and chocolate","code":"311300","location":"US","description":"BEA Code \u0026 Name is '311300:Sugar and confectionery product manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises (1) establishments that process agricultural inputs, such as sugarcane, beet, and cacao, to give rise to a new product (sugar or chocolate), and (2) those that begin with sugar and chocolate and process these further."},{"id":"311410/frozen food/us","index":201,"name":"Frozen food","code":"311410","location":"US","description":"BEA Code \u0026 Name is '311410:Frozen food manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing frozen fruit, frozen juices, frozen vegetables, and frozen specialty foods (except seafood), such as frozen dinners, entrees, and side dishes; frozen pizza; frozen whipped toppings; and frozen waffles, pancakes, and french toast."},{"id":"311420/fruit and vegetable preservation/us","index":202,"name":"Fruit and vegetable preservation","code":"311420","location":"US","description":"BEA Code \u0026 Name is '311420:Fruit and vegetable canning, pickling, and drying'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing canned, pickled, and dried fruits, vegetables, and specialty foods. Establishments in this industry may package the dried or dehydrated ingredients they make with other purchased ingredients. Examples of products made by these establishments are canned juices; canned baby foods; canned soups (except seafood); canned dry beans; canned tomato-based sauces, such as catsup, salsa, chili, spaghetti, barbeque, and tomato paste, pickles, relishes, jams and jellies, dried soup mixes and bullions, and sauerkraut."},{"id":"31151a/fluid milk and butter/us","index":203,"name":"Fluid milk and butter","code":"31151A","location":"US","description":"BEA Code \u0026 Name is '31151A:Fluid milk and butter manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments that manufacture dairy products from raw milk, processed milk, and dairy substitutes. Related NAICS codes are: 311511-2"},{"id":"311513/cheese/us","index":204,"name":"Cheese","code":"311513","location":"US","description":"BEA Code \u0026 Name is '311513:Cheese manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in (1) manufacturing cheese products (except cottage cheese) from raw milk and/or processed milk products and/or (2) manufacturing cheese substitutes from soybean and other nondairy substances."},{"id":"311514/dry, condensed, and evaporated dairy/us","index":205,"name":"Dry, condensed, and evaporated dairy","code":"311514","location":"US","description":"BEA Code \u0026 Name is '311514:Dry, condensed, and evaporated dairy product manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing dry, condensed, and evaporated milk and dairy substitute products."},{"id":"311520/ice cream and frozen desserts/us","index":206,"name":"Ice cream and frozen desserts","code":"311520","location":"US","description":"BEA Code \u0026 Name is '311520:Ice cream and frozen dessert manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing ice cream, frozen yogurts, frozen ices, sherbets, frozen tofu, and other frozen desserts (except bakery products)."},{"id":"31161a/packaged meat (except poultry)/us","index":207,"name":"Packaged meat (except poultry)","code":"31161A","location":"US","description":"BEA Code \u0026 Name is '31161A:Animal (except poultry) slaughtering, rendering, and processing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in one or more of the following: (1) slaughtering animals; (2) preparing processed meats and meat byproducts; and (3) rendering and/or refining animal fat, bones, and meat scraps. This industry includes establishments primarily engaged in assembly cutting and packing of meats (i.e., boxed meats) from purchased carcasses. Related NAICS codes are: 311611-3"},{"id":"311615/packaged poultry/us","index":208,"name":"Packaged poultry","code":"311615","location":"US","description":"BEA Code \u0026 Name is '311615:Poultry processing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in (1) slaughtering poultry and small game and/or (2) preparing processed poultry and small game meat and meat byproducts."},{"id":"311700/seafood/us","index":209,"name":"Seafood","code":"311700","location":"US","description":"BEA Code \u0026 Name is '311700:Seafood product preparation and packaging'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in one or more of the following: (1) canning seafood (including soup); (2) smoking, salting, and drying seafood; (3) eviscerating fresh fish by removing heads, fins, scales, bones, and entrails; (4) shucking and packing fresh shellfish; (5) processing marine fats and oils; and (6) freezing seafood. Establishments known as \"floating factory ships\" that are engaged in the gathering and processing of seafood into canned seafood products are included in this industry."},{"id":"311810/bread and other baked goods/us","index":210,"name":"Bread and other baked goods","code":"311810","location":"US","description":"BEA Code \u0026 Name is '311810:Bread and bakery product manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing fresh and frozen bread and other bakery products."},{"id":"3118a0/cookies, crackers, pastas, and tortillas/us","index":211,"name":"Cookies, crackers, pastas, and tortillas","code":"3118A0","location":"US","description":"BEA Code \u0026 Name is '3118A0:Cookie, cracker, pasta, and tortilla manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in one of the following: (1) manufacturing fresh and frozen bread and other bakery products; (2) retailing bread and other bakery products not for immediate consumption made on the premises from flour, not from prepared dough; (3) manufacturing cookies, crackers, and dry pasta; (4) manufacturing prepared flour mixes or dough from flour ground elsewhere; or (5) manufacturing tortillas. Related NAICS codes are: 31182-3"},{"id":"311910/snack foods/us","index":212,"name":"Snack foods","code":"311910","location":"US","description":"BEA Code \u0026 Name is '311910:Snack food manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in manufacturing food (except animal food; grain and oilseed milling; sugar and confectionery products; preserved fruit, vegetable, and specialty foods; dairy products; meat products; seafood products; and bakeries and tortillas). The industry group includes industries with different production processes, such as snack food manufacturing; coffee and tea manufacturing; concentrate, syrup, condiment, and spice manufacturing; and, in general, an entire range of other miscellaneous food product manufacturing."},{"id":"311920/coffee and tea/us","index":213,"name":"Coffee and tea","code":"311920","location":"US","description":"BEA Code \u0026 Name is '311920:Coffee and tea manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in one or more of the following: (1) roasting coffee; (2) manufacturing coffee and tea concentrates (including instant and freeze-dried); (3) blending tea; (4) manufacturing herbal tea; and (5) manufacturing coffee extracts, flavorings, and syrups."},{"id":"311930/flavored drink concentrates/us","index":214,"name":"Flavored drink concentrates","code":"311930","location":"US","description":"BEA Code \u0026 Name is '311930:Flavoring syrup and concentrate manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing flavoring syrup drink concentrates and related products for soda fountain use or for the manufacture of soft drinks."},{"id":"311940/seasonings and dressings/us","index":215,"name":"Seasonings and dressings","code":"311940","location":"US","description":"BEA Code \u0026 Name is '311940:Seasoning and dressing manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in one or more of the following: (1) manufacturing dressings and sauces, such as mayonnaise, salad dressing, vinegar, mustard, horseradish, soy sauce, tarter sauce, Worcestershire sauce, and other prepared sauces (except tomato-based and gravies); (2) manufacturing spices, table salt, seasoning, and flavoring extracts (except coffee and meat), and natural food colorings; and (3) manufacturing dry mix food preparations, such as salad dressing mixes, gravy and sauce mixes, frosting mixes, and other dry mix preparations."},{"id":"311990/all other foods/us","index":216,"name":"All other foods","code":"311990","location":"US","description":"BEA Code \u0026 Name is '311990:All other food manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing food (except animal food; grain and oilseed milling; sugar and confectionery products; preserved fruits, vegetables, and specialties; dairy products; meat products; seafood products; bakeries and tortillas; snack foods; coffee and tea; flavoring syrups and concentrates; seasonings; and dressings). Included in this industry are establishments primarily engaged in mixing purchased dried and/or dehydrated ingredients including those mixing purchased dried and/or dehydrated ingredients for soup mixes and bouillon."},{"id":"312110/soft drinks, bottled water, and ice/us","index":217,"name":"Soft drinks, bottled water, and ice","code":"312110","location":"US","description":"BEA Code \u0026 Name is '312110:Soft drink and ice manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in one or more of the following: (1) manufacturing soft drinks; (2) manufacturing ice; and (3) purifying and bottling water."},{"id":"312120/breweries and beer/us","index":218,"name":"Breweries and beer","code":"312120","location":"US","description":"BEA Code \u0026 Name is '312120:Breweries'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in brewing beer, ale, malt liquors, and nonalcoholic beer."},{"id":"312130/wineries and wine/us","index":219,"name":"Wineries and wine","code":"312130","location":"US","description":"BEA Code \u0026 Name is '312130:Wineries'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in one or more of the following: (1) growing grapes and manufacturing wines and brandies; (2) manufacturing wines and brandies from grapes and other fruits grown elsewhere; and (3) blending wines and brandies."},{"id":"312140/distilleries and spirits/us","index":220,"name":"Distilleries and spirits","code":"312140","location":"US","description":"BEA Code \u0026 Name is '312140:Distilleries'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in one or more of the following: (1) distilling potable liquors (except brandies); (2) distilling and blending liquors; and (3) blending and mixing liquors and other ingredients."},{"id":"312200/tobacco products/us","index":221,"name":"Tobacco products","code":"312200","location":"US","description":"BEA Code \u0026 Name is '312200:Tobacco product manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing cigarettes, cigars, smoking and chewing tobacco, and reconstituted tobacco."},{"id":"313100/fiber, yarn, and thread/us","index":222,"name":"Fiber, yarn, and thread","code":"313100","location":"US","description":"BEA Code \u0026 Name is '313100:Fiber, yarn, and thread mills'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in one or more of the following: (1) spinning yarn; (2) manufacturing thread of any fiber; (3) texturizing, throwing, twisting, and winding purchased yarn or manmade fiber filaments; and (4) producing hemp yarn and further processing into rope or bags."},{"id":"313200/fabric/us","index":223,"name":"Fabric","code":"313200","location":"US","description":"BEA Code \u0026 Name is '313200:Fabric mills'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises (1) Broadwoven Fabric Mills, (2) Narrow Fabric Mills and Schiffli Machine Embroidery, (3) Nonwoven Fabric Mills, and (4) Knit Fabric Mills."},{"id":"313300/finished and coated fabric/us","index":224,"name":"Finished and coated fabric","code":"313300","location":"US","description":"BEA Code \u0026 Name is '313300:Textile and fabric finishing and fabric coating mills'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises (1) Textile and Fabric Finishing Mills, and (2) Fabric Coating Mills."},{"id":"314110/carpets and rugs/us","index":225,"name":"Carpets and rugs","code":"314110","location":"US","description":"BEA Code \u0026 Name is '314110:Carpet and rug mills'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in (1) manufacturing woven, tufted, and other carpets and rugs, such as art squares, floor mattings, needlepunch carpeting, and door mats and mattings, from textile materials or from twisted paper, grasses, reeds, sisal, jute, or rags and/or (2) finishing carpets and rugs."},{"id":"314120/curtains and linens/us","index":226,"name":"Curtains and linens","code":"314120","location":"US","description":"BEA Code \u0026 Name is '314120:Curtain and linen mills'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing household textile products, such as curtains, draperies, linens, bedspreads, sheets, tablecloths, towels, and shower curtains, from purchased materials."},{"id":"314900/other textiles/us","index":227,"name":"Other textiles","code":"314900","location":"US","description":"BEA Code \u0026 Name is '314900:Other textile product mills'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in making textile products (except carpets and rugs, curtains and draperies, and other household textile products) from purchased materials."},{"id":"315000/clothing/us","index":228,"name":"Clothing","code":"315000","location":"US","description":"BEA Code \u0026 Name is '315000:Apparel manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Apparel Manufacturing subsector group establishments with two distinct manufacturing processes: (1) cut and sew (i.e., purchasing fabric and cutting and sewing to make a garment), and (2) the manufacture of garments in establishments that first knit fabric and then cut and sew the fabric into a garment. The Apparel Manufacturing subsector includes a diverse range of establishments manufacturing full lines of ready-to-wear apparel and custom apparel: apparel contractors, performing cutting or sewing operations on materials owned by others; jobbers performing entrepreneurial functions involved in apparel manufacture; and tailors, manufacturing custom garments for individual clients are all included. Knitting, when done alone, is classified in the Textile Mills subsector, but when knitting is combined with the production of complete garments, the activity is classified in Apparel Manufacturing."},{"id":"316000/leather/us","index":229,"name":"Leather","code":"316000","location":"US","description":"BEA Code \u0026 Name is '316000:Leather and allied product manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Establishments in the Leather and Allied Product Manufacturing subsector transform hides into leather by tanning or curing and fabricating the leather into products for final consumption. It also includes the manufacture of similar products from other materials, including products (except apparel) made from \"leather substitutes,\" such as rubber, plastics, or textiles. Rubber footwear, textile luggage, and plastics purses or wallets are examples of \"leather substitute\" products included in this group. The products made from leather substitutes are included in this subsector because they are made in similar ways leather products are made (e.g., luggage). They are made in the same establishments, so it is not practical to separate them. The inclusion of leather making in this subsector is partly because leather tanning is a relatively small industry that has few close neighbors as a production process, partly because leather is an input to some of the other products classified in this subsector and partly for historical reasons."},{"id":"322110/wood pulp/us","index":230,"name":"Wood pulp","code":"322110","location":"US","description":"BEA Code \u0026 Name is '322110:Pulp mills'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing pulp without manufacturing paper or paperboard. The pulp is made by separating the cellulose fibers from the other impurities in wood or other materials, such as used or recycled rags, linters, scrap paper, and straw."},{"id":"322120/paper/us","index":231,"name":"Paper","code":"322120","location":"US","description":"BEA Code \u0026 Name is '322120:Paper mills'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing paper from pulp. These establishments may manufacture or purchase pulp. In addition, the establishments may convert the paper they make. The activity of making paper classifies an establishment into this industry regardless of the output."},{"id":"322130/cardboard/us","index":232,"name":"Cardboard","code":"322130","location":"US","description":"BEA Code \u0026 Name is '322130:Paperboard mills'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing paperboard from pulp. These establishments may manufacture or purchase pulp. In addition, the establishments may also convert the paperboard they make."},{"id":"322210/cardboard containers/us","index":233,"name":"Cardboard containers","code":"322210","location":"US","description":"BEA Code \u0026 Name is '322210:Paperboard container manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in converting paperboard into containers without manufacturing paperboard. These establishments use corrugating, cutting, and shaping machinery to form paperboard into containers. Products made by these establishments include boxes, corrugated sheets, pads, pallets, paper dishes, and fiber drums, and reels."},{"id":"322220/paper bags and coated paper/us","index":234,"name":"Paper bags and coated paper","code":"322220","location":"US","description":"BEA Code \u0026 Name is '322220:Paper bag and coated and treated paper manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in one or more of the following: (1) cutting and coating paper and paperboard; (2) cutting and laminating paper, paperboard, and other flexible materials (except plastics film to plastics film); (3) manufacturing bags, multiwall bags, sacks of paper, metal foil, coated paper, laminates, or coated combinations of paper and foil with plastics film; (4) manufacturing laminated aluminum and other converted metal foils from purchased foils; and (5) surface coating paper or paperboard."},{"id":"322230/stationery/us","index":235,"name":"Stationery","code":"322230","location":"US","description":"BEA Code \u0026 Name is '322230:Stationery product manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in converting paper or paperboard into products used for writing, filing, art work, and similar applications."},{"id":"322291/sanitary paper (tissues, napkins, diapers, etc.)/us","index":236,"name":"Sanitary paper (tissues, napkins, diapers, etc.)","code":"322291","location":"US","description":"BEA Code \u0026 Name is '322291:Sanitary paper product manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in converting purchased sanitary paper stock or wadding into sanitary paper products, such as facial tissues, handkerchiefs, table napkins, toilet paper, towels, disposable diapers, sanitary napkins, and tampons."},{"id":"322299/all other converted paper products/us","index":237,"name":"All other converted paper products","code":"322299","location":"US","description":"BEA Code \u0026 Name is '322299:All other converted paper product manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in converting paper or paperboard into products (except containers, bags, coated and treated paper, stationery products, and sanitary paper products) or converting pulp into pulp products, such as egg cartons, food trays, and other food containers from molded pulp."},{"id":"323110/books, newspapers, magazines, and other print media/us","index":238,"name":"Books, newspapers, magazines, and other print media","code":"323110","location":"US","description":"BEA Code \u0026 Name is '323110:Printing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in printing on apparel and textile products, paper, metal, glass, plastics, and other materials, except fabric (grey goods). The printing processes employed include, but are not limited to, lithographic, gravure, screen, flexographic, digital, and letterpress. Establishments in this industry do not manufacture the stock that they print, but may perform postprinting activities, such as folding, cutting, or laminating the materials they print, and mailing."},{"id":"323120/printing support/us","index":239,"name":"Printing support","code":"323120","location":"US","description":"BEA Code \u0026 Name is '323120:Support activities for printing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in performing prepress (e.g., platemaking, typesetting) and postpress services (e.g., book binding) in support of printing activities."},{"id":"324110/gasoline, fuels, and by-products of petroleum refining/us","index":240,"name":"Gasoline, fuels, and by-products of petroleum refining","code":"324110","location":"US","description":"BEA Code \u0026 Name is '324110:Petroleum refineries'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in refining crude petroleum into refined petroleum. Petroleum refining involves one or more of the following activities: (1) fractionation; (2) straight distillation of crude oil; and (3) cracking."},{"id":"324121/asphalt pavement/us","index":241,"name":"Asphalt pavement","code":"324121","location":"US","description":"BEA Code \u0026 Name is '324121:Asphalt paving mixture and block manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing asphalt and tar paving mixtures and blocks from purchased asphaltic materials."},{"id":"324122/asphalt shingles/us","index":242,"name":"Asphalt shingles","code":"324122","location":"US","description":"BEA Code \u0026 Name is '324122:Asphalt shingle and coating materials manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in (1) saturating purchased mats and felts with asphalt or tar from purchased asphaltic materials and (2) manufacturing asphalt and tar and roofing cements and coatings from purchased asphaltic materials."},{"id":"324190/other petroleum and coal products/us","index":243,"name":"Other petroleum and coal products","code":"324190","location":"US","description":"BEA Code \u0026 Name is '324190:Other petroleum and coal products manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing petroleum products (except asphalt paving, roofing and saturated materials) from refined petroleum or coal products made in coke ovens not integrated with a steel mill."},{"id":"325110/petrochemicals/us","index":244,"name":"Petrochemicals","code":"325110","location":"US","description":"BEA Code \u0026 Name is '325110:Petrochemical manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in (1) manufacturing acyclic (i.e., aliphatic) hydrocarbons such as ethylene, propylene, and butylene made from refined petroleum or liquid hydrocarbons and/or (2) manufacturing cyclic aromatic hydrocarbons such as benzene, toluene, styrene, xylene, ethyl benzene, and cumene made from refined petroleum or liquid hydrocarbons."},{"id":"325120/compressed gases/us","index":245,"name":"Compressed Gases","code":"325120","location":"US","description":"BEA Code \u0026 Name is '325120:Industrial gas manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing industrial organic and inorganic gases in compressed, liquid, and solid forms."},{"id":"325130/synthetic dyes and pigments/us","index":246,"name":"Synthetic dyes and pigments","code":"325130","location":"US","description":"BEA Code \u0026 Name is '325130:Synthetic dye and pigment manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing synthetic organic and inorganic dyes and pigments, such as lakes and toners (except electrostatic and photographic)."},{"id":"325180/other basic inorganic chemicals/us","index":247,"name":"Other basic inorganic chemicals","code":"325180","location":"US","description":"BEA Code \u0026 Name is '325180:Other basic inorganic chemical manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing basic inorganic chemicals (except industrial gases and synthetic dyes and pigments)."},{"id":"325190/other basic organic chemicals/us","index":248,"name":"Other basic organic chemicals","code":"325190","location":"US","description":"BEA Code \u0026 Name is '325190:Other basic organic chemical manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing basic organic chemicals (except petrochemicals, industrial gases, and synthetic dyes and pigments)."},{"id":"325211/plastics/us","index":249,"name":"Plastics","code":"325211","location":"US","description":"BEA Code \u0026 Name is '325211:Plastics material and resin manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in (1) manufacturing resins, plastics materials, and nonvulcanizable thermoplastic elastomers and mixing and blending resins on a custom basis and/or (2) manufacturing noncustomized synthetic resins."},{"id":"3252a0/synthetic rubber and artificial and synthetic fibers/us","index":250,"name":"Synthetic rubber and artificial and synthetic fibers","code":"3252A0","location":"US","description":"BEA Code \u0026 Name is '3252A0:Synthetic rubber and artificial and synthetic fibers and filaments manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in one of the following: (1) manufacturing synthetic resins, plastics materials, and nonvulcanizable elastomers and mixing and blending resins on a custom basis; (2) manufacturing noncustomized synthetic resins; (3) manufacturing synthetic rubber; (4) manufacturing cellulosic (e.g., rayon, acetate) and noncellulosic (e.g., nylon, polyolefin, polyester) fibers and filaments in the form of monofilament, filament yarn, staple, or tow; or (5) manufacturing and texturizing cellulosic and noncellulosic fibers and filaments. Related NAICS codes are: 325212, 32522"},{"id":"325310/fertilizers/us","index":251,"name":"Fertilizers","code":"325310","location":"US","description":"BEA Code \u0026 Name is '325310:Fertilizer manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises (1) Fertilizer Manufacturing, and (2) Pesticide and Other Agricultural Chemical Manufacturing."},{"id":"325320/pesticides/us","index":252,"name":"Pesticides","code":"325320","location":"US","description":"BEA Code \u0026 Name is '325320:Pesticide and other agricultural chemical manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in the formulation and preparation of agricultural and household pest control chemicals (except fertilizers)."},{"id":"325411/medicinal and botanical ingredients/us","index":253,"name":"Medicinal and botanical ingredients","code":"325411","location":"US","description":"BEA Code \u0026 Name is '325411:Medicinal and botanical manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in (1) manufacturing uncompounded medicinal chemicals and their derivatives (i.e., generally for use by pharmaceutical preparation manufacturers) and/or (2) grading, grinding, and milling uncompounded botanicals."},{"id":"325412/pharmaceutical products (pills, powders, solutions, etc.)/us","index":254,"name":"Pharmaceutical products (pills, powders, solutions, etc.)","code":"325412","location":"US","description":"BEA Code \u0026 Name is '325412:Pharmaceutical preparation manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing in-vivo diagnostic substances and pharmaceutical preparations (except biological) intended for internal and external consumption in dose forms, such as ampoules, tablets, capsules, vials, ointments, powders, solutions, and suspensions."},{"id":"325413/blood sugar, pregnancy, and other diagnostic test kits/us","index":255,"name":"Blood sugar, pregnancy, and other diagnostic test kits","code":"325413","location":"US","description":"BEA Code \u0026 Name is '325413:In-vitro diagnostic substance manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing in-vitro (i.e., not taken internally) diagnostic substances, such as chemical, biological, or radioactive substances. The substances are used for diagnostic tests that are performed in test tubes, petri dishes, machines, and other diagnostic test-type devices."},{"id":"325414/vaccines and other biological medical products/us","index":256,"name":"Vaccines and other biological medical products","code":"325414","location":"US","description":"BEA Code \u0026 Name is '325414:Biological product (except diagnostic) manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in manufacturing vaccines, toxoids, blood fractions, and culture media of plant or animal origin (except diagnostic)."},{"id":"325510/paints and coatings/us","index":257,"name":"Paints and coatings","code":"325510","location":"US","description":"BEA Code \u0026 Name is '325510:Paint and coating manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in (1) mixing pigments, solvents, and binders into paints and other coatings, such as stains, varnishes, lacquers, enamels, shellacs, and water repellant coatings for concrete and masonry, and/or (2) manufacturing allied paint products, such as putties, paint and varnish removers, paint brush cleaners, and frit."},{"id":"325520/adhesives/us","index":258,"name":"Adhesives","code":"325520","location":"US","description":"BEA Code \u0026 Name is '325520:Adhesive manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing adhesives, glues, and caulking compounds."},{"id":"325610/soap and cleaning compounds/us","index":259,"name":"Soap and cleaning compounds","code":"325610","location":"US","description":"BEA Code \u0026 Name is '325610:Soap and cleaning compound manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing and packaging soap and other cleaning compounds, surface active agents, and textile and leather finishing agents used to reduce tension or speed the drying process."},{"id":"325620/toiletries/us","index":260,"name":"Toiletries","code":"325620","location":"US","description":"BEA Code \u0026 Name is '325620:Toilet preparation manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in preparing, blending, compounding, and packaging toilet preparations, such as perfumes, shaving preparations, hair preparations, face creams, lotions (including sunscreens), and other cosmetic preparations."},{"id":"325910/ink and ink cartridges/us","index":261,"name":"Ink and ink cartridges","code":"325910","location":"US","description":"BEA Code \u0026 Name is '325910:Printing ink manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing printing and inkjet inks and inkjet cartridges."},{"id":"3259a0/chemicals (except basic chemicals, agrichemicals, polymers, paints, pharmaceuticals,soaps, cleaning compounds)/us","index":262,"name":"Chemicals (except basic chemicals, agrichemicals, polymers, paints, pharmaceuticals,soaps, cleaning compounds)","code":"3259A0","location":"US","description":"BEA Code \u0026 Name is '3259A0:All other chemical product and preparation manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in manufacturing chemical products (except basic chemicals; resins, synthetic rubber, cellulosic and noncellulosic fibers and filaments; pesticides, fertilizers, and other agricultural chemicals; pharmaceuticals and medicines; paints, coatings, and adhesives; soaps and cleaning compounds; and toilet preparations). Related NAICS codes are: 32592, 32599"},{"id":"326110/plastic bags, films, and sheets/us","index":263,"name":"Plastic bags, films, and sheets","code":"326110","location":"US","description":"BEA Code \u0026 Name is '326110:Plastics packaging materials and unlaminated film and sheet manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in (1) converting plastics resins into unsupported plastics film and sheet and/or (2) forming, coating or laminating plastics film and sheet into plastics bags."},{"id":"326120/plastic pipe, fittings, and sausage casings/us","index":264,"name":"Plastic pipe, fittings, and sausage casings","code":"326120","location":"US","description":"BEA Code \u0026 Name is '326120:Plastics pipe, pipe fitting, and unlaminated profile shape manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing plastics pipes and pipe fittings, and plastics profile shapes such as rod, tube, and sausage casings."},{"id":"326130/laminated plastic plates and shapes/us","index":265,"name":"Laminated plastic plates and shapes","code":"326130","location":"US","description":"BEA Code \u0026 Name is '326130:Laminated plastics plate, sheet (except packaging), and shape manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in laminating plastics profile shapes such as plate, sheet (except packaging), and rod. The lamination process generally involves bonding or impregnating profiles with plastics resins and compressing them under heat."},{"id":"326140/polystyrene foam products/us","index":266,"name":"Polystyrene foam products","code":"326140","location":"US","description":"BEA Code \u0026 Name is '326140:Polystyrene foam product manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing polystyrene foam products."},{"id":"326150/urethane and other foam products/us","index":267,"name":"Urethane and other foam products","code":"326150","location":"US","description":"BEA Code \u0026 Name is '326150:Urethane and other foam product (except polystyrene) manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing plastics foam products (except polystyrene)."},{"id":"326160/plastic bottles/us","index":268,"name":"Plastic bottles","code":"326160","location":"US","description":"BEA Code \u0026 Name is '326160:Plastics bottle manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing plastics bottles."},{"id":"326190/other plastic products/us","index":269,"name":"Other plastic products","code":"326190","location":"US","description":"BEA Code \u0026 Name is '326190:Other plastics product manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing resilient floor covering and other plastics products (except film, sheet, bags, profile shapes, pipes, pipe fittings, laminates, foam products, and bottles)."},{"id":"326210/rubber tires/us","index":270,"name":"Rubber tires","code":"326210","location":"US","description":"BEA Code \u0026 Name is '326210:Tire manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing tires and inner tubes from natural and synthetic rubber and retreading or rebuilding tires."},{"id":"326220/rubber and plastic belts and hoses/us","index":271,"name":"Rubber and plastic belts and hoses","code":"326220","location":"US","description":"BEA Code \u0026 Name is '326220:Rubber and plastics hoses and belting manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing rubber hose and/or plastics (reinforced) hose and belting from natural and synthetic rubber and/or plastics resins. Establishments manufacturing garden hoses from purchased hose are included in this industry."},{"id":"326290/other rubber products/us","index":272,"name":"Other rubber products","code":"326290","location":"US","description":"BEA Code \u0026 Name is '326290:Other rubber product manufacturing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in manufacturing rubber products (except tires, hoses, and belting) from natural and synthetic rubber."},{"id":"420000/wholesale trade/us","index":273,"name":"Wholesale trade","code":"420000","location":"US","description":"BEA Code \u0026 Name is '420000:Wholesale trade'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: The Wholesale Trade sector comprises establishments engaged in wholesaling merchandise, generally without transformation, and rendering services incidental to the sale of merchandise. The merchandise described in this sector includes the outputs of agriculture, mining, manufacturing, and certain information industries, such as publishing. The wholesaling process is an intermediate step in the distribution of merchandise. Wholesalers are organized to sell or arrange the purchase or sale of (a) goods for resale (i.e., goods sold to other wholesalers or retailers), (b) capital or durable nonconsumer goods, and (c) raw and intermediate materials and supplies used in production. Wholesalers sell merchandise to other businesses and normally operate from a warehouse or office. These warehouses and offices are characterized by having little or no display of merchandise. In addition, neither the design nor the location of the premises is intended to solicit walk-in traffic. Wholesalers do not normally use advertising directed to the general public. Customers are generally reached initially via telephone, in-person marketing, or by specialized advertising that may include Internet and other electronic means. Follow-up orders are either vendor-initiated or client-initiated, generally based on previous sales, and typically exhibit strong ties between sellers and buyers. In fact, transactions are often conducted between wholesalers and clients that have long-standing business relationships. This sector comprises two main types of wholesalers: merchant wholesalers that sell goods on their own account and business to business electronic markets, agents, and brokers that arrange sales and purchases for others generally for a commission or fee. (1) Establishments that sell goods on their own account are known as wholesale merchants, distributors, jobbers, drop shippers, and import/export merchants. Also included as wholesale merchants are sales offices and sales branches (but not retail stores) maintained by manufacturing, refining, or mining enterprises apart from their plants or mines for the purpose of marketing their products. Merchant wholesale establishments typically maintain their own warehouse, where they receive and handle goods for their customers. Goods are generally sold without transformation, but may include integral functions, such as sorting, packaging, labeling, and other marketing services. (2) Establishments arranging for the purchase or sale of goods owned by others or purchasing goods, generally on a commission basis are known as business to business electronic markets, agents and brokers, commission merchants, import/export agents and brokers, auction companies, and manufacturers' representatives. These establishments operate from offices and generally do not own or handle the goods they sell. Some wholesale establishments may be connected with a single manufacturer and promote and sell the particular manufacturers' products to a wide range of other wholesalers or retailers. Other wholesalers may be connected to a retail chain, or limited number of retail chains, and only provide a variety of products needed by that particular retail operation(s). These wholesalers may obtain the products from a wide range of manufacturers. Still other wholesalers may not take title to the goods, but act as agents and brokers for a commission. Although, in general, wholesaling normally denotes sales in large volumes, durable nonconsumer goods may be sold in single units. Sales of capital or durable nonconsumer goods used in the production of goods and services, such as farm machinery, medium and heavy duty trucks, and industrial machinery, are always included in wholesale trade."},{"id":"441000/vehicles and parts sales/us","index":274,"name":"Vehicles and parts sales","code":"441000","location":"US","description":"BEA Code \u0026 Name is '441000:Motor vehicle and parts dealers'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Motor Vehicle and Parts Dealers subsector retail motor vehicles and parts from fixed point-of-sale locations. Establishments in this subsector typically operate from a showroom and/or an open lot where the vehicles are on display. The display of vehicles and the related parts require little by way of display equipment. The personnel generally include both the sales and sales support staff familiar with the requirements for registering and financing a vehicle as well as a staff of parts experts and mechanics trained to provide repair and maintenance services for the vehicles. Specific industries have been included in this subsector to identify the type of vehicle being retailed. Sales of capital or durable nonconsumer goods, such as medium and heavy-duty trucks, are always included in wholesale trade. These goods are virtually never sold through retail methods."},{"id":"445000/food and beverage stores/us","index":275,"name":"Food and beverage stores","code":"445000","location":"US","description":"BEA Code \u0026 Name is '445000:Food and beverage stores'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Food and Beverage Stores subsector usually retail food and beverages merchandise from fixed point-of-sale locations. Establishments in this subsector have special equipment (e.g., freezers, refrigerated display cases, refrigerators) for displaying food and beverage goods. They have staff trained in the processing of food products to guarantee the proper storage and sanitary conditions required by regulatory authority."},{"id":"452000/general merchandise stores/us","index":276,"name":"General merchandise stores","code":"452000","location":"US","description":"BEA Code \u0026 Name is '452000:General merchandise stores'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the General Merchandise Stores subsector retail new general merchandise from fixed pointof- sale locations. Establishments in this subsector are unique in that they have the equipment and staff capable of retailing a large variety of goods from a single location. This includes a variety of display equipment and staff trained to provide information on many lines of products."},{"id":"4a0000/other retail/us","index":277,"name":"Other retail","code":"4A0000","location":"US","description":"BEA Code \u0026 Name is '4A0000:Other retail'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises (1) Furniture and Home Furnishings Stores, (2) Electronics and Appliance Stores, (3) Building Material and Garden Equipment and Supplies Dealers, (4) Health and Personal Care Stores, (5) Gasoline Stations, (6) Clothing and Clothing Accessories Stores, (7) Sporting Goods, Hobby, Book, and Music Stores, (8) Miscellaneous Store Retailers (e.g. Florists), and (9) Nonstore Retailers. Related NAICS codes are: 442-4, 446-8, 451, 453-4"},{"id":"481000/air transport/us","index":278,"name":"Air transport","code":"481000","location":"US","description":"BEA Code \u0026 Name is '481000:Air transportation'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Air Transportation subsector provide air transportation of passengers and/or cargo using aircraft, such as airplanes and helicopters. The subsector distinguishes scheduled from nonscheduled air transportation. Scheduled air carriers fly regular routes on regular schedules and operate even if flights are only partially loaded. Nonscheduled carriers often operate during nonpeak time slots at busy airports. These establishments have more flexibility with respect to choice of airport, hours of operation, load factors, and similar operational characteristics. Nonscheduled carriers provide chartered air transportation of passengers, cargo, or specialty flying services. Specialty flying services establishments use generalpurpose aircraft to provide a variety of specialized flying services. Scenic and sightseeing air transportation and air courier services are not included in this subsector but are included in Subsector 487, Scenic and Sightseeing Transportation and in Subsector 492, Couriers and Messengers. Although these activities may use aircraft, they are different from the activities included in air transportation. Air sightseeing does not usually involve place-to-place transportation; the passenger's flight (e.g., balloon ride, aerial sightseeing) typically starts and ends at the same location. Courier services (individual package or cargo delivery) include more than air transportation; road transportation is usually required to deliver the cargo to the intended recipient."},{"id":"482000/rail transport/us","index":279,"name":"Rail transport","code":"482000","location":"US","description":"BEA Code \u0026 Name is '482000:Rail transportation'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Rail Transportation subsector provide rail transportation of passengers and/or cargo using railroad rolling stock. The railroads in this subsector primarily either operate on networks, with physical facilities, labor force, and equipment spread over an extensive geographic area, or operate over a short distance on a local rail line. Scenic and sightseeing rail transportation and street railroads, commuter rail, and rapid transit are not included in this subsector but are included in Subsector 487, Scenic and Sightseeing Transportation, and Subsector 485, Transit and Ground Passenger Transportation, respectively. Although these activities use railroad rolling stock, they are different from the activities included in rail transportation. Sightseeing and scenic railroads do not usually involve place-to-place transportation; the passenger's trip typically starts and ends at the same location. Commuter railroads operate in a manner more consistent with local and urban transit and are often part of integrated transit systems."},{"id":"483000/water transport (boats, ships, ferries)/us","index":280,"name":"Water transport (boats, ships, ferries)","code":"483000","location":"US","description":"BEA Code \u0026 Name is '483000:Water transportation'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Water Transportation subsector provide water transportation of passengers and cargo using watercraft, such as ships, barges, and boats. The subsector is composed of two industry groups: (1) one for deep sea, coastal, and Great Lakes; and (2) one for inland water transportation. This split typically reflects the difference in equipment used. Scenic and sightseeing water transportation services are not included in this subsector but are included in Subsector 487, Scenic and Sightseeing Transportation. Although these activities use watercraft, they are different from the activities included in water transportation. Water sightseeing does not usually involve place-to-place transportation; the passenger's trip starts and ends at the same location."},{"id":"484000/truck transport/us","index":281,"name":"Truck transport","code":"484000","location":"US","description":"BEA Code \u0026 Name is '484000:Truck transportation'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Truck Transportation subsector provide over-the-road transportation of cargo using motor vehicles, such as trucks and tractor trailers. The subsector is subdivided into general freight trucking and specialized freight trucking. This distinction reflects differences in equipment used, type of load carried, scheduling, terminal, and other networking services. General freight transportation establishments handle a wide variety of general commodities, generally palletized, and transported in a container or van trailer. Specialized freight transportation is the transportation of cargo that, because of size, weight, shape, or other inherent characteristics require specialized equipment for transportation. Each of these industry groups is further subdivided based on distance traveled. Local trucking establishments primarily carry goods within a single metropolitan area and its adjacent nonurban areas. Long distance trucking establishments carry goods between metropolitan areas. The Specialized Freight Trucking industry group includes a separate industry for Used Household and Office Goods Moving. The household and office goods movers are separated because of the substantial network of establishments that has developed to deal with local and long-distance moving and the associated storage. In this area, the same establishment provides both local and long-distance services, while other specialized freight establishments generally limit their services to either local or long-distance hauling."},{"id":"485000/passenger ground transport/us","index":282,"name":"Passenger ground transport","code":"485000","location":"US","description":"BEA Code \u0026 Name is '485000:Transit and ground passenger transportation'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Transit and Ground Passenger Transportation subsector include a variety of passenger transportation activities, such as urban transit systems; chartered bus, school bus, and interurban bus transportation; and taxis. These activities are distinguished based primarily on such production process factors as vehicle types, routes, and schedules. In this subsector, the principal splits identify scheduled transportation as separate from nonscheduled transportation. The scheduled transportation industry groups are Urban Transit Systems, Interurban and Rural Bus Transportation, and School and Employee Bus Transportation. The nonscheduled industry groups are the Charter Bus Industry and Taxi and Limousine Service. The Other Transit and Ground Passenger Transportation industry group includes both scheduled and nonscheduled transportation. Scenic and sightseeing ground transportation services are not included in this subsector but are included in Subsector 487, Scenic and Sightseeing Transportation. Sightseeing does not usually involve place-toplace transportation; the passenger's trip starts and ends at the same location."},{"id":"486000/pipeline transport/us","index":283,"name":"Pipeline transport","code":"486000","location":"US","description":"BEA Code \u0026 Name is '486000:Pipeline transportation'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Pipeline Transportation subsector use transmission pipelines to transport products, such as crude oil, natural gas, refined petroleum products, and slurry. Industries are identified based on the products transported (i.e., pipeline transportation of crude oil, natural gas, refined petroleum products, and other products). The Pipeline Transportation of Natural Gas industry includes the storage of natural gas because the storage is usually done by the pipeline establishment and because a pipeline is inherently a network in which all the nodes are interdependent."},{"id":"48a000/scenic and sightseeing transportation and support activities for transportation/us","index":284,"name":"Scenic and sightseeing transportation and support activities for transportation","code":"48A000","location":"US","description":"BEA Code \u0026 Name is '48A000:Scenic and sightseeing transportation and support activities for transportation'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: 1) Industries in the Scenic and Sightseeing Transportation subsector utilize transportation equipment to provide recreation and entertainment. These activities have a production process distinct from passenger transportation carried out for the purpose of other types of for-hire transportation. This process does not emphasize efficient transportation; in fact, such activities often use obsolete vehicles, such as steam trains, to provide some extra ambience. The activity is local in nature, usually involving a same-day return to the point of departure.   The Scenic and Sightseeing Transportation subsector is separated into three industries based on the mode: land, water, and other.   Activities that are recreational in nature and involve participation by the customer, such as white-water rafting, are generally excluded from this subsector, unless they impose an impact on part of the transportation system. Charter boat fishing, for example, is included in the Scenic and Sightseeing Transportation, Water industry.  2) Industries in the Support Activities for Transportation subsector provide services which support transportation. These services may be provided to transportation carrier establishments or to the general public. This subsector includes a wide array of establishments, including air traffic control services, marine cargo handling, and motor vehicle towing.   The Support Activities for Transportation subsector includes services to transportation but is separated by type of mode serviced. The Support Activities for Rail Transportation industry includes services to the rail industry (e.g., railroad switching and terminal establishments).   Ship repair and maintenance not done in a shipyard are included in Other Support Activities for Water Transportation. An example would be floating drydock services in a harbor.   Excluded from this subsector are establishments primarily engaged in providing factory conversion and overhaul of transportation equipment, which are classified in Subsector 336, Transportation Equipment Manufacturing. Also, establishments primarily engaged in providing rental and leasing of transportation equipment without operator are classified in Subsector 532, Rental and Leasing Services.  Related NAICS codes are: 487, 488"},{"id":"492000/couriers and messengers/us","index":285,"name":"Couriers and messengers","code":"492000","location":"US","description":"BEA Code \u0026 Name is '492000:Couriers and messengers'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Couriers and Messengers subsector provide intercity and/or local delivery of parcels and documents (including express delivery services) without operating under a universal service obligation. These articles can be described as those that may be handled by one person without using special equipment. This allows the collection, pick-up, and delivery operations to be done with limited labor costs and minimal equipment. Sorting and transportation activities, where necessary, are generally mechanized. The restriction to small parcels partly distinguishes these establishments from those in the transportation industries. The complete network of courier services establishments also distinguishes these transportation services from local messenger and delivery establishments in this subsector. This includes the establishments that perform intercity transportation as well as establishments that, under contract to them, perform local pick-up and delivery. Messengers, which usually deliver within a metropolitan or single urban area, may use bicycle, foot, small truck, or van."},{"id":"493000/warehousing/us","index":286,"name":"Warehousing","code":"493000","location":"US","description":"BEA Code \u0026 Name is '493000:Warehousing and storage'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Warehousing and Storage subsector are primarily engaged in operating warehousing and storage facilities for general merchandise, refrigerated goods, and other warehouse products. These establishments provide facilities to store goods. They do not sell the goods they handle. These establishments take responsibility for storing the goods and keeping them secure. They may also provide a range of services, often referred to as logistics services, related to the distribution of goods. Logistics services can include labeling, breaking bulk, inventory control and management, light assembly, order entry and fulfillment, packaging, pick and pack, price marking and ticketing, and transportation arrangement. However, establishments in this industry group always provide warehousing or storage services in addition to any logistic services. Furthermore, the warehousing or storage of goods must be more than incidental to the performance of services, such as price marking. Bonded warehousing and storage services and warehouses located in free trade zones are included in the industries of this subsector."},{"id":"511110/newspapers/us","index":287,"name":"Newspapers","code":"511110","location":"US","description":"BEA Code \u0026 Name is '511110:Newspaper publishers'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments known as newspaper publishers. Establishments in this industry carry out operations necessary for producing and distributing newspapers, including gathering news; writing news columns, feature stories, and editorials; and selling and preparing advertisements. These establishments may publish newspapers in print or electronic form."},{"id":"511120/magazines and journals/us","index":288,"name":"Magazines and journals","code":"511120","location":"US","description":"BEA Code \u0026 Name is '511120:Periodical Publishers'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments known either as magazine publishers or periodical publishers. These establishments carry out the operations necessary for producing and distributing magazines and other periodicals, such as gathering, writing, and editing articles, and selling and preparing advertisements. These establishments may publish magazines and other periodicals in print or electronic form."},{"id":"511130/books/us","index":289,"name":"Books","code":"511130","location":"US","description":"BEA Code \u0026 Name is '511130:Book publishers'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments known as book publishers. Establishments in this industry carry out design, editing, and marketing activities necessary for producing and distributing books. These establishments may publish books in print, electronic, or audio form."},{"id":"5111a0/directory, mailing list, and other publishers/us","index":290,"name":"Directory, mailing list, and other publishers","code":"5111A0","location":"US","description":"BEA Code \u0026 Name is '5111A0:Directory, mailing list, and other publishers'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in publishing newspapers, magazines, other periodicals, books, directories and mailing lists, and other works, such as calendars, greeting cards, and maps. These works are characterized by the intellectual creativity required in their development and are usually protected by copyright. Publishers distribute or arrange for the distribution of these works. Related NAICS codes are: 51114, 51119"},{"id":"511200/software/us","index":291,"name":"Software","code":"511200","location":"US","description":"BEA Code \u0026 Name is '511200:Software publishers'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in computer software publishing or publishing and reproduction. Establishments in this industry carry out operations necessary for producing and distributing computer software, such as designing, providing documentation, assisting in installation, and providing support services to software purchasers. These establishments may design, develop, and publish, or publish only."},{"id":"512100/movies and film/us","index":292,"name":"Movies and film","code":"512100","location":"US","description":"BEA Code \u0026 Name is '512100:Motion picture and video industries'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Publishing establishments may create the works in-house, contract for, purchase, or compile works that were originally created by others. These works may be published in one or more formats, such as print and/or electronic form, including proprietary electronic networks. Establishments in this industry may print, reproduce, or offer direct access to the works themselves or may arrange with others to carry out such functions."},{"id":"512200/sound recording/us","index":293,"name":"Sound recording","code":"512200","location":"US","description":"BEA Code \u0026 Name is '512200:Sound recording industries'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in producing and distributing musical recordings, in publishing music, or in providing sound recording and related services."},{"id":"515100/radio and television/us","index":294,"name":"Radio and television","code":"515100","location":"US","description":"BEA Code \u0026 Name is '515100:Radio and television broadcasting'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Establishments that both print and publish may fill excess capacity with commercial or job printing. However, the publishing activity is still considered to be the primary activity of these establishments."},{"id":"515200/cable and subscription programming/us","index":295,"name":"Cable and subscription programming","code":"515200","location":"US","description":"BEA Code \u0026 Name is '515200:Cable and other subscription programming'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in operating studios and facilities for the broadcasting of programs on a subscription or fee basis. The broadcast programming is typically narrowcast in nature (e.g., limited format, such as news, sports, education, or youth-oriented). These establishments produce programming in their own facilities or acquire programming from external sources. The programming material is usually delivered to a third party, such as cable systems or direct-to-home satellite systems, for transmission to viewers."},{"id":"517110/telecommunications/us","index":296,"name":"Telecommunications","code":"517110","location":"US","description":"BEA Code \u0026 Name is '517110:Wired telecommunications carriers'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in operating and/or providing access to transmission facilities and infrastructure that they own and/or lease for the transmission of voice, data, text, sound, and video using wired telecommunications networks. Transmission facilities may be based on a single technology or a combination of technologies. Establishments in this industry use the wired telecommunications network facilities that they operate to provide a variety of services, such as wired telephony services, including VoIP services; wired (cable) audio and video programming distribution; and wired broadband Internet services. By exception, establishments providing satellite television distribution services using facilities and infrastructure that they operate are included in this industry."},{"id":"517210/wireless telecommunications/us","index":297,"name":"Wireless telecommunications","code":"517210","location":"US","description":"BEA Code \u0026 Name is '517210:Wireless telecommunications carriers (except satellite)'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments engaged in operating and maintaining switching and transmission facilities to provide communications via the airwaves. Establishments in this industry have spectrum licenses and provide services using that spectrum, such as cellular phone services, paging services, wireless Internet access, and wireless video services."},{"id":"517a00/satellite, telecommunications resellers, and all other telecommunications/us","index":298,"name":"Satellite, telecommunications resellers, and all other telecommunications","code":"517A00","location":"US","description":"BEA Code \u0026 Name is '517A00:Satellite, telecommunications resellers, and all other telecommunications'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Telecommunications subsector group establishments that provide telecommunications and the services related to that activity (e.g., telephony, including Voice over Internet Protocol (VoIP); cable and satellite television distribution services; Internet access; telecommunications reselling services). The Telecommunications subsector is primarily engaged in operating, and/or providing access to facilities for the transmission of voice, data, text, sound, and video. Transmission facilities may be based on a single technology or a combination of technologies. Establishments in the Telecommunications subsector are grouped into four industry groups. The first three are comprised of establishments that operate transmission facilities and infrastructure that they own and/or lease, and provide telecommunications services using those facilities. The distinction among the first three industry groups is the type of infrastructure operated (i.e., wired, wireless, or satellite). The fourth industry group is comprised of establishments that provide support activities, telecommunications reselling services, or many of the same services provided by establishments in the first three industry groups, but do not operate as telecommunications carriers. Related NAICS codes are: 5174, 5719"},{"id":"518200/data processing and hosting/us","index":299,"name":"Data processing and hosting","code":"518200","location":"US","description":"BEA Code \u0026 Name is '518200:Data processing, hosting, and related services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Establishments primarily engaged as independent contractors in the installation and maintenance of broadcasting and telecommunications systems are classified in Sector 23, Construction. Establishments known as Internet cafes, primarily engaged in offering limited Internet connectivity in combination with other services such as facsimile services, training, rental of on-site personal computers, game rooms, or food services are classified in Subsector 561, Administrative and Support Services, or Subsector 722, Food Services and Drinking Places, depending on the primary activity."},{"id":"5191a0/news syndicates, libraries, archives, internet publishing and all other information services/us","index":300,"name":"News syndicates, libraries, archives, Internet publishing and all other information services","code":"5191A0","location":"US","description":"BEA Code \u0026 Name is '5191A0:News syndicates, libraries, archives and all other information services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Other Information Services subsector group establishments supplying information, storing and providing access to information, searching and retrieving information, operating Web sites that use search engines to allow for searching information on the Internet, or publishing and/or broadcasting content exclusively on the Internet. The main components of the subsector are news syndicates, libraries, archives, exclusive Internet publishing and/or broadcasting, and Web Search Portals. Related NAICS codes are: 51911-2, 51919"},{"id":"519130/internet publishing and broadcasting/us","index":301,"name":"Internet publishing and broadcasting","code":"519130","location":"US","description":"BEA Code \u0026 Name is '519130:Internet publishing and broadcasting and Web search portals'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in 1) publishing and/or broadcasting content on the Internet exclusively or 2) operating Web sites that use a search engine to generate and maintain extensive databases of Internet addresses and content in an easily searchable format (and known as Web search portals). The publishing and broadcasting establishments in this industry do not provide traditional (non-Internet) versions of the content that they publish or broadcast. They provide textual, audio, and/or video content of general or specific interest on the Internet exclusively. Establishments known as Web search portals often provide additional Internet services, such as e-mail, connections to other web sites, auctions, news, and other limited content, and serve as a home base for Internet users."},{"id":"52a000/monetary authorities and depository credit intermediation/us","index":302,"name":"Monetary authorities and depository credit intermediation","code":"52A000","location":"US","description":"BEA Code \u0026 Name is '52A000:Monetary authorities and depository credit intermediation'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: The Finance and Insurance sector comprises establishments primarily engaged in financial transactions (transactions involving the creation, liquidation, or change in ownership of financial assets) and/or in facilitating financial transactions. Three principal types of activities are identified:   1. Raising funds by taking deposits and/or issuing securities and, in the process, incurring liabilities. Establishments engaged in this activity use raised funds to acquire financial assets by making loans and/or purchasing securities. Putting themselves at risk, they channel funds from lenders to borrowers and transform or repackage the funds with respect to maturity, scale, and risk. This activity is known as financial intermediation.   2. Pooling of risk by underwriting insurance and annuities. Establishments engaged in this activity collect fees, insurance premiums, or annuity considerations; build up reserves; invest those reserves; and make contractual payments. Fees are based on the expected incidence of the insured risk and the expected return on investment.   3. Providing specialized services facilitating or supporting financial intermediation, insurance, and employee benefit programs.   In addition, monetary authorities charged with monetary control are included in this sector.   The subsectors, industry groups, and industries within the NAICS Finance and Insurance sector are defined on the basis of their unique production processes. As with all industries, the production processes are distinguished by their use of specialized human resources and specialized physical capital. In addition, the way in which these establishments acquire and allocate financial capital, their source of funds, and the use of those funds provides a third basis for distinguishing characteristics of the production process. For instance, the production process in raising funds through deposit-taking is different from the process of raising funds in bond or money markets. The process of making loans to individuals also requires different production processes than does the creation of investment pools or the underwriting of securities.   Most of the Finance and Insurance subsectors contain one or more industry groups of (1) intermediaries with similar patterns of raising and using funds and (2) establishments engaged in activities that facilitate, or are otherwise related to, that type of financial or insurance intermediation. Industries within this sector are defined in terms of activities for which a production process can be specified, and many of these activities are not exclusive to a particular type of financial institution. To deal with the varied activities taking place within existing financial institutions, the approach is to split these institutions into components performing specialized services. This requires defining the units engaged in providing those services and developing procedures that allow for their delineation. These units are the equivalents for finance and insurance of the establishments defined for other industries.   The output of many financial services, as well as the inputs and the processes by which they are combined, cannot be observed at a single location and can only be defined at a higher level of the organizational structure of the enterprise. Additionally, a number of independent activities that represent separate and distinct production processes may take place at a single location belonging to a multilocation financial firm. Activities are more likely to be homogeneous with respect to production characteristics than are locations, at least in financial services. The classification defines activities broadly enough that it can be used both by those classifying by location and by those employing a more top-down approach to the delineation of the establishment.   Establishments engaged in activities that facilitate, or are otherwise related to, the various types of intermediation have been included in individual subsectors, rather than in a separate subsector dedicated to services alone because these services are performed by intermediaries, as well as by specialist establishments, the extent to which the activity of the intermediaries can be separately identified is not clear.   The Finance and Insurance sector has been defined to encompass establishments primarily engaged in financial transactions; that is, transactions involving the creation, liquidation, change in ownership of financial assets; or in facilitating financial transactions. Financial industries are extensive users of electronic means for facilitating the verification of financial balances, authorizing transactions, transferring funds to and from transactors accounts, notifying banks (or credit card issuers) of the individual transactions, and providing daily summaries. Since these transaction processing activities are integral to the production of finance and insurance services, establishments that principally provide a financial transaction processing service are classified to this sector, rather than to the data processing industry in the Information sector.   Legal entities that hold portfolios of assets on behalf of others are significant and data on them are required for a variety of purposes. Thus for NAICS, these funds, trusts, and other financial vehicles are the fifth subsector of the Finance and Insurance sector. These entities earn interest, dividends, and other property income, but have little or no employment and no revenue from the sale of services. Separate establishments and employees devoted to the management of funds are classified in Industry Group 5239, Other Financial Investment Activities. Related NAICS codes are: 521, 5221"},{"id":"522a00/nondepository credit intermediation and related activities/us","index":303,"name":"Nondepository credit intermediation and related activities","code":"522A00","location":"US","description":"BEA Code \u0026 Name is '522A00:Nondepository credit intermediation and related activities'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Credit Intermediation and Related Activities subsector group establishments that (1) lend funds raised from depositors; (2) lend funds raised from credit market borrowing; or (3) facilitate the lending of funds or issuance of credit by engaging in such activities as mortgage and loan brokerage, clearinghouse and reserve services, and check cashing services. Related NAICS codes are: 5222-3"},{"id":"523a00/securities and commodities brokerage and exchanges/us","index":304,"name":"Securities and commodities brokerage and exchanges","code":"523A00","location":"US","description":"BEA Code \u0026 Name is '523A00:Securities and commodity contracts intermediation and brokerage'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Securities, Commodity Contracts, and Other Financial Investments and Related Activities subsector group establishments that are primarily engaged in one of the following: (1) underwriting securities issues and/or making markets for securities and commodities; (2) acting as agents (i.e., brokers) between buyers and sellers of securities and commodities; (3) providing securities and commodity exchange services; and (4) providing other services, such as managing portfolios of assets; providing investment advice; and trust, fiduciary, and custody services. Related NAICS codes are: 5231-2"},{"id":"523900/investment advice, portfolio management, and other financial advising services/us","index":305,"name":"Investment advice, portfolio management, and other financial advising services","code":"523900","location":"US","description":"BEA Code \u0026 Name is '523900:Other financial investment activities'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in one of the following: (1) acting as principals in buying or selling financial contracts (except investment bankers, securities dealers, and commodity contracts dealers); (2) acting as agents (i.e., brokers) (except securities brokerages and commodity contracts brokerages) in buying or selling financial contracts; or (3) providing other investment services (except securities and commodity exchanges), such as portfolio management; investment advice; and trust, fiduciary, and custody services."},{"id":"524100/insurance carriers/us","index":306,"name":"Insurance carriers","code":"524100","location":"US","description":"BEA Code \u0026 Name is '524100:Insurance carriers'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in underwriting (assuming the risk, assigning premiums, and so forth) annuities and insurance policies and investing premiums to build up a portfolio of financial assets to be used against future claims. Direct insurance carriers are establishments that are primarily engaged in initially underwriting and assuming the risk of annuities and insurance policies. Reinsurance carriers are establishments that are primarily engaged in assuming all or part of the risk associated with an existing insurance policy (or set of policies) originally underwritten by another insurance carrier. Industries are defined in terms of the type of risk being insured against, such as death, loss of employment because of age or disability, and/or property damage. Contributions and premiums are set on the basis of actuarial calculations of probable payouts based on risk factors from experience tables and expected investment returns on reserves."},{"id":"524200/insurance agencies and brokerages/us","index":307,"name":"Insurance agencies and brokerages","code":"524200","location":"US","description":"BEA Code \u0026 Name is '524200:Insurance agencies, brokerages, and related activities'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in (1) acting as agents (i.e., brokers) in selling annuities and insurance policies or (2) providing other employee benefits and insurance related services, such as claims adjustment and third party administration."},{"id":"525000/funds, trusts, and financial vehicles/us","index":308,"name":"Funds, trusts, and financial vehicles","code":"525000","location":"US","description":"BEA Code \u0026 Name is '525000:Funds, trusts, and other financial vehicles'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Funds, Trusts, and Other Financial Vehicles subsector are comprised of legal entities (i.e., funds, plans, and/or programs) organized to pool securities or other assets on behalf of shareholders or beneficiaries of employee benefit or other trust funds. The portfolios are customized to achieve specific investment characteristics, such as diversification, risk, rate of return, and price volatility. These entities earn interest, dividends, and other investment income, but have little or no employment and no revenue from the sale of services. Establishments with employees devoted to the management of funds are classified in Industry Group 5239, Other Financial Investment Activities. Establishments primarily engaged in holding the securities of (or other equity interests in) other firms are classified in Sector 55, Management of Companies and Enterprises. Equity Real Estate Investment Trusts (REITs) that are primarily engaged in leasing buildings, dwellings, or other real estate property to others are classified in Subsector 531, Real Estate."},{"id":"5310hs/housing/us","index":309,"name":"Housing","code":"5310HS","location":"US","description":"BEA Code \u0026 Name is '5310HS:Housing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: The Real Estate and Rental and Leasing sector comprises establishments primarily engaged in renting, leasing, or otherwise allowing the use of tangible or intangible assets, and establishments providing related services. The major portion of this sector comprises establishments that rent, lease, or otherwise allow the use of their own assets by others. The assets may be tangible, as is the case of real estate and equipment, or intangible, as is the case with patents and trademarks.   This sector also includes establishments primarily engaged in managing real estate for others, selling, renting and/or buying real estate for others, and appraising real estate. These activities are closely related to this sectors main activity, and it was felt that from a production basis they would best be included here. In addition, a substantial proportion of property management is self-performed by lessors.   The main components of this sector are the real estate lessors industries (including equity real estate investment trusts (REITs)); equipment lessors industries (including motor vehicles, computers, and consumer goods); and lessors of nonfinancial intangible assets (except copyrighted works).   Excluded from this sector are establishments primarily engaged in renting or leasing equipment with operators. Establishments renting or leasing equipment with operators are classified in various subsectors of NAICS depending on the nature of the services provided (e.g., transportation, construction, agriculture). These activities are excluded from this sector because the client is paying for the expertise and knowledge of the equipment operator, in addition to the rental of the equipment. In many cases, such as the rental of heavy construction equipment, the operator is essential to operate the equipment. Related NAICS codes are: 531"},{"id":"531ore/other real estate/us","index":310,"name":"Other real estate","code":"531ORE","location":"US","description":"BEA Code \u0026 Name is '531ORE:Other real estate'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: The Real Estate and Rental and Leasing sector comprises establishments primarily engaged in renting, leasing, or otherwise allowing the use of tangible or intangible assets, and establishments providing related services. The major portion of this sector comprises establishments that rent, lease, or otherwise allow the use of their own assets by others. The assets may be tangible, as is the case of real estate and equipment, or intangible, as is the case with patents and trademarks.   This sector also includes establishments primarily engaged in managing real estate for others, selling, renting and/or buying real estate for others, and appraising real estate. These activities are closely related to this sectors main activity, and it was felt that from a production basis they would best be included here. In addition, a substantial proportion of property management is self-performed by lessors.   The main components of this sector are the real estate lessors industries (including equity real estate investment trusts (REITs)); equipment lessors industries (including motor vehicles, computers, and consumer goods); and lessors of nonfinancial intangible assets (except copyrighted works).   Excluded from this sector are establishments primarily engaged in renting or leasing equipment with operators. Establishments renting or leasing equipment with operators are classified in various subsectors of NAICS depending on the nature of the services provided (e.g., transportation, construction, agriculture). These activities are excluded from this sector because the client is paying for the expertise and knowledge of the equipment operator, in addition to the rental of the equipment. In many cases, such as the rental of heavy construction equipment, the operator is essential to operate the equipment. Related NAICS codes are: 531"},{"id":"532100/vehicle rental and leasing/us","index":311,"name":"Vehicle rental and leasing","code":"532100","location":"US","description":"BEA Code \u0026 Name is '532100:Automotive equipment rental and leasing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in renting or leasing the following types of vehicles: passenger cars and trucks without drivers, and utility trailers. These establishments generally operate from a retail-like facility. Some establishments offer only short-term rental, others only longerterm leases, and some provide both types of services."},{"id":"532a00/consumer goods and general rental centers/us","index":312,"name":"Consumer goods and general rental centers","code":"532A00","location":"US","description":"BEA Code \u0026 Name is '532A00:Consumer goods and general rental centers'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: The Real Estate and Rental and Leasing sector comprises establishments primarily engaged in renting, leasing, or otherwise allowing the use of tangible or intangible assets, and establishments providing related services. The major portion of this sector comprises establishments that rent, lease, or otherwise allow the use of their own assets by others. The assets may be tangible, as is the case of real estate and equipment, or intangible, as is the case with patents and trademarks.   This sector also includes establishments primarily engaged in managing real estate for others, selling, renting and/or buying real estate for others, and appraising real estate. These activities are closely related to this sectors main activity, and it was felt that from a production basis they would best be included here. In addition, a substantial proportion of property management is self-performed by lessors.   The main components of this sector are the real estate lessors industries (including equity real estate investment trusts (REITs)); equipment lessors industries (including motor vehicles, computers, and consumer goods); and lessors of nonfinancial intangible assets (except copyrighted works).   Excluded from this sector are establishments primarily engaged in renting or leasing equipment with operators. Establishments renting or leasing equipment with operators are classified in various subsectors of NAICS depending on the nature of the services provided (e.g., transportation, construction, agriculture). These activities are excluded from this sector because the client is paying for the expertise and knowledge of the equipment operator, in addition to the rental of the equipment. In many cases, such as the rental of heavy construction equipment, the operator is essential to operate the equipment. Related NAICS codes are: 5322-3"},{"id":"532400/commercial equipment rental/us","index":313,"name":"Commercial equipment rental","code":"532400","location":"US","description":"BEA Code \u0026 Name is '532400:Commercial and industrial machinery and equipment rental and leasing'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in renting or leasing commercial-type and industrial-type machinery and equipment. The types of establishments included in this industry group are generally involved in providing capital or investment-type equipment that clients use in their business operations. These establishments typically cater to a business clientele and do not generally operate a retail-like or store-front facility."},{"id":"533000/lessors of nonfinancial intangible assets/us","index":314,"name":"Lessors of nonfinancial intangible assets","code":"533000","location":"US","description":"BEA Code \u0026 Name is '533000:Lessors of nonfinancial intangible assets'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Lessors of Nonfinancial Intangible Assets (except Copyrighted Works) subsector include establishments that are primarily engaged in assigning rights to assets, such as patents, trademarks, brand names, and/or franchise agreements for which a royalty payment or licensing fee is paid to the asset holder. Establishments in this subsector own the patents, trademarks, and/or franchise agreements that they allow others to use or reproduce for a fee and may or may not have created those assets. Establishments that allow franchisees the use of the franchise name, contingent on the franchisee buying products or services from the franchisor, are classified elsewhere. Excluded from this subsector are establishments primarily engaged in leasing real property and establishments primarily engaged in leasing tangible assets, such as automobiles, computers, consumer goods, and industrial machinery and equipment. These establishments are classified in Subsector 531, Real Estate and Subsector 532, Rental and Leasing Services, respectively."},{"id":"541100/legal services/us","index":315,"name":"Legal services","code":"541100","location":"US","description":"BEA Code \u0026 Name is '541100:Legal services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises (1) Offices of Lawyers, (2) Offices of Notaries, and (3) Other Legal Services including:  (a) Title Abstract and Settlement Offices, and (b) All Other Legal Services."},{"id":"541511/custom computer programming/us","index":316,"name":"Custom computer programming","code":"541511","location":"US","description":"BEA Code \u0026 Name is '541511:Custom computer programming services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in writing, modifying, testing, and supporting software to meet the needs of a particular customer."},{"id":"541512/computer systems design/us","index":317,"name":"Computer systems design","code":"541512","location":"US","description":"BEA Code \u0026 Name is '541512:Computer systems design services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in planning and designing computer systems that integrate computer hardware, software, and communication technologies. The hardware and software components of the system may be provided by this establishment or company as part of integrated services or may be provided by third parties or vendors. These establishments often install the system and train and support users of the system."},{"id":"54151a/other computer related services, including facilities management/us","index":318,"name":"Other computer related services, including facilities management","code":"54151A","location":"US","description":"BEA Code \u0026 Name is '54151A:Other computer related services, including facilities management'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in providing expertise in the field of information technologies through one or more of the following activities: (1) writing, modifying, testing, and supporting software to meet the needs of a particular customer; (2) planning and designing computer systems that integrate computer hardware, software, and communication technologies; (3) on-site management and operation of clients computer systems and/or data processing facilities; and (4) other professional and technical computer-related advice and services. Related NAICS codes are: 541513, 541519"},{"id":"541200/accounting, tax preparation, bookkeeping, and payroll/us","index":319,"name":"Accounting, tax preparation, bookkeeping, and payroll","code":"541200","location":"US","description":"BEA Code \u0026 Name is '541200:Accounting, tax preparation, bookkeeping, and payroll services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in providing services, such as auditing of accounting records, designing accounting systems, preparing financial statements, developing budgets, preparing tax returns, processing payrolls, bookkeeping, and billing."},{"id":"541300/architectural, engineering, and related services/us","index":320,"name":"Architectural, engineering, and related services","code":"541300","location":"US","description":"BEA Code \u0026 Name is '541300:Architectural, engineering, and related services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises (1) Architectural Services, (2) Landscape Architectural Services, (3) Engineering Services, (4) Drafting Services, (5) Building Inspection Services, (6) Geophysical Surveying and Mapping Services, (7) Surveying and Mapping (except Geophysical) Services, and (8) Testing Laboratories."},{"id":"541400/specialized design/us","index":321,"name":"Specialized design","code":"541400","location":"US","description":"BEA Code \u0026 Name is '541400:Specialized design services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments providing specialized design services (except architectural, engineering, and computer systems design)."},{"id":"541610/management consulting/us","index":322,"name":"Management consulting","code":"541610","location":"US","description":"BEA Code \u0026 Name is '541610:Management consulting services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in providing advice and assistance to businesses and other organizations on management issues, such as strategic and organizational planning; financial planning and budgeting; marketing objectives and policies; human resource policies, practices, and planning; production scheduling; and control planning."},{"id":"5416a0/environmental and other technical consulting services/us","index":323,"name":"Environmental and other technical consulting services","code":"5416A0","location":"US","description":"BEA Code \u0026 Name is '5416A0:Environmental and other technical consulting services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises (1) Management Consulting Services, (2) Environmental Consulting Services, and (3) Other Scientific and Technical Consulting Services. Related NAICS codes are: 54162, 54169"},{"id":"541700/scientific research and development/us","index":324,"name":"Scientific research and development","code":"541700","location":"US","description":"BEA Code \u0026 Name is '541700:Scientific research and development services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments engaged in conducting original investigation undertaken on a systematic basis to gain new knowledge (research) and/or the application of research findings or other scientific knowledge for the creation of new or significantly improved products or processes (experimental development). The industries within this industry group are defined on the basis of the domain of research; that is, on the scientific expertise of the establishment."},{"id":"541800/advertising and public relations/us","index":325,"name":"Advertising and public relations","code":"541800","location":"US","description":"BEA Code \u0026 Name is '541800:Advertising, public relations, and related services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises (1) Advertising Agencies, (2) Public Relations Agencies, (3) Media Buying Agencies, (4) Media Representatives, (5) Display Advertising, (6) Direct Mail Advertising, (7) Advertising Material Distribution Services, and (8) Other Services Related to Advertising."},{"id":"5419a0/marketing research and all other miscellaneous professional, scientific, and technical services/us","index":326,"name":"Marketing research and all other miscellaneous professional, scientific, and technical services","code":"5419A0","location":"US","description":"BEA Code \u0026 Name is '5419A0:Marketing research and all other miscellaneous professional, scientific, and technical services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments engaged in professional, scientific, and technical services (except legal services; accounting, tax preparation, bookkeeping, and related services; architectural, engineering, and related services; specialized design services; computer systems design and related services; management, scientific, and technical consulting services; scientific research and development services; and advertising, public relations and related services). Related NAICS codes are: 54191, 54193, 54199"},{"id":"541920/photographers/us","index":327,"name":"Photographers","code":"541920","location":"US","description":"BEA Code \u0026 Name is '541920:Photographic services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in providing still, video, or digital photography services. These establishments may specialize in a particular field of photography, such as commercial and industrial photography, portrait photography, and special events photography. Commercial or portrait photography studios are included in this industry."},{"id":"541940/veterinarians/us","index":328,"name":"Veterinarians","code":"541940","location":"US","description":"BEA Code \u0026 Name is '541940:Veterinary services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments of licensed veterinary practitioners primarily engaged in the practice of veterinary medicine, dentistry, or surgery for animals; and establishments primarily engaged in providing testing services for licensed veterinary practitioners."},{"id":"550000/company and enterprise management/us","index":329,"name":"Company and enterprise management","code":"550000","location":"US","description":"BEA Code \u0026 Name is '550000:Management of companies and enterprises'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: The Management of Companies and Enterprises sector comprises (1) establishments that hold the securities of (or other equity interests in) companies and enterprises for the purpose of owning a controlling interest or influencing management decisions or (2) establishments (except government establishments) that administer, oversee, and manage establishments of the company or enterprise and that normally undertake the strategic or organizational planning and decision making role of the company or enterprise. Establishments that administer, oversee, and manage may hold the securities of the company or enterprise. Establishments in this sector perform essential activities that are often undertaken, in-house, by establishments in many sectors of the economy. By consolidating the performance of these activities of the enterprise at one establishment, economies of scale are achieved. Government establishments primarily engaged in administering, overseeing, and managing governmental programs are classified in Sector 92, Public Administration. Establishments primarily engaged in providing a range of day-to-day office administrative services, such as financial planning, billing and recordkeeping, personnel, and physical distribution and logistics are classified in Industry 56111, Office Administrative Services."},{"id":"561100/office administration/us","index":330,"name":"Office administration","code":"561100","location":"US","description":"BEA Code \u0026 Name is '561100:Office administrative services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in providing a range of day-to-day office administrative services, such as financial planning; billing and recordkeeping; personnel; and physical distribution and logistics for others on a contract or fee basis. These establishments do not provide operating staff to carry out the complete operations of a business."},{"id":"561200/facilities support/us","index":331,"name":"Facilities support","code":"561200","location":"US","description":"BEA Code \u0026 Name is '561200:Facilities support services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in providing operating staff to perform a combination of support services within a client's facilities. Establishments in this industry typically provide a combination of services, such as janitorial, maintenance, trash disposal, guard and security, mail routing, reception, laundry, and related services to support operations within facilities. These establishments provide operating staff to carry out these support activities; but are not involved with or responsible for the core business or activities of the client. Establishments providing facilities (except computer and/or data processing) operation support services and establishments providing private jail services or operating correctional facilities (i.e., jails) on a contract or fee basis are included in this industry."},{"id":"561300/employment services/us","index":332,"name":"Employment services","code":"561300","location":"US","description":"BEA Code \u0026 Name is '561300:Employment services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises (1) Employment Placement Agencies and Executive Search Services, (2) Temporary Help Services, and (3) Professional Employer Organizations."},{"id":"561400/business support/us","index":333,"name":"Business support","code":"561400","location":"US","description":"BEA Code \u0026 Name is '561400:Business support services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments engaged in performing activities that are ongoing routine business support functions that businesses and organizations traditionally do for themselves."},{"id":"561500/travel arrangement and reservation/us","index":334,"name":"Travel arrangement and reservation","code":"561500","location":"US","description":"BEA Code \u0026 Name is '561500:Travel arrangement and reservation services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises (1) Travel Agencies, (2) Tour Operators, and (3) Other Travel Arrangement and Reservation Services including:  (a) Convention and Visitors Bureaus, and (b) All Other Travel Arrangement and Reservation Services."},{"id":"561600/investigation and security/us","index":335,"name":"Investigation and security","code":"561600","location":"US","description":"BEA Code \u0026 Name is '561600:Investigation and security services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises (1) Investigation, Guard, and Armored Car Services, and (2) Security Systems Services."},{"id":"561700/buildings and dwellings services/us","index":336,"name":"Buildings and dwellings services","code":"561700","location":"US","description":"BEA Code \u0026 Name is '561700:Services to buildings and dwellings'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises (1) Exterminating and Pest Control Services, (2) Janitorial Services, (3) Landscaping Services, (4) Carpet and Upholstery Cleaning Services, and (5) Other Services to Buildings and Dwellings."},{"id":"561900/other support services/us","index":337,"name":"Other support services","code":"561900","location":"US","description":"BEA Code \u0026 Name is '561900:Other support services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in providing day-to-day business and other organizational support services (except office administrative services; facilities support services; employment services; business support services; travel arrangement and reservation services; security and investigation services; and services to buildings and dwellings)."},{"id":"562000/waste management and remediation/us","index":338,"name":"Waste management and remediation","code":"562000","location":"US","description":"BEA Code \u0026 Name is '562000:Waste management and remediation services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Waste Management and Remediation Services subsector group establishments engaged in the collection, treatment, and disposal of waste materials. This includes establishments engaged in local hauling of waste materials; operating materials recovery facilities (i.e., those that sort recyclable materials from the trash stream); providing remediation services (i.e., those that provide for the cleanup of contaminated buildings, mine sites, soil, or ground water); and providing septic pumping and other miscellaneous waste management services. There are three industry groups within the subsector that separate these activities into waste collection, waste treatment and disposal, and remediation and other waste management. Excluded from this subsector are establishments primarily engaged in collecting, treating, and disposing waste through sewer systems or sewage treatment facilities that are classified in Industry 22132, Sewage Treatment Facilities and establishments primarily engaged in long-distance hauling of waste materials that are classified in Industry 48423, Specialized Freight (except Used Goods) Trucking, Long-Distance. Also, there are some activities that appear to be related to waste management, but that are not included in this subsector. For example, establishments primarily engaged in providing waste management consulting services are classified in Industry 54162, Environmental Consulting Services."},{"id":"611100/elementary and secondary schools/us","index":339,"name":"Elementary and secondary schools","code":"611100","location":"US","description":"BEA Code \u0026 Name is '611100:Elementary and secondary schools'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in furnishing academic courses and associated course work that comprise a basic preparatory education. A basic preparatory education ordinarily constitutes kindergarten through 12th grade. This industry includes school boards and school districts."},{"id":"611a00/colleges, universities, junior colleges, and professional schools/us","index":340,"name":"Colleges, universities, junior colleges, and professional schools","code":"611A00","location":"US","description":"BEA Code \u0026 Name is '611A00:Junior colleges, colleges, universities, and professional schools'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: The Educational Services sector comprises establishments that provide instruction and training in a wide variety of subjects. This instruction and training is provided by specialized establishments, such as schools, colleges, universities, and training centers. These establishments may be privately owned and operated for profit or not for profit, or they may be publicly owned and operated. They may also offer food and/or accommodation services to their students.   Educational services are usually delivered by teachers or instructors that explain, tell, demonstrate, supervise, and direct learning. Instruction is imparted in diverse settings, such as educational institutions, the workplace, or the home, and through diverse means, such as correspondence, television, the Internet, or other electronic and distance-learning methods. The training provided by these establishments may include the use of simulators and simulation methods. It can be adapted to the particular needs of the students, for example sign language can replace verbal language for teaching students with hearing impairments. All industries in the sector share this commonality of process, namely, labor inputs of instructors with the requisite subject matter expertise and teaching ability. Related NAICS codes are: 6112-3"},{"id":"611b00/other educational services/us","index":341,"name":"Other educational services","code":"611B00","location":"US","description":"BEA Code \u0026 Name is '611B00:Other educational services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: The Educational Services sector comprises establishments that provide instruction and training in a wide variety of subjects. This instruction and training is provided by specialized establishments, such as schools, colleges, universities, and training centers. These establishments may be privately owned and operated for profit or not for profit, or they may be publicly owned and operated. They may also offer food and/or accommodation services to their students.   Educational services are usually delivered by teachers or instructors that explain, tell, demonstrate, supervise, and direct learning. Instruction is imparted in diverse settings, such as educational institutions, the workplace, or the home, and through diverse means, such as correspondence, television, the Internet, or other electronic and distance-learning methods. The training provided by these establishments may include the use of simulators and simulation methods. It can be adapted to the particular needs of the students, for example sign language can replace verbal language for teaching students with hearing impairments. All industries in the sector share this commonality of process, namely, labor inputs of instructors with the requisite subject matter expertise and teaching ability. Related NAICS codes are: 6114-7"},{"id":"621100/physicians/us","index":342,"name":"Physicians","code":"621100","location":"US","description":"BEA Code \u0026 Name is '621100:Offices of physicians'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments of health practitioners having the degree of M.D. (Doctor of Medicine) or D.O. (Doctor of Osteopathy) primarily engaged in the independent practice of general or specialized medicine (e.g., anesthesiology, oncology, ophthalmology, psychiatry) or surgery. These practitioners operate private or group practices in their own offices (e.g., centers, clinics) or in the facilities of others, such as hospitals or HMO medical centers."},{"id":"621200/dentists/us","index":343,"name":"Dentists","code":"621200","location":"US","description":"BEA Code \u0026 Name is '621200:Offices of dentists'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments of health practitioners having the degree of D.M.D. (Doctor of Dental Medicine), D.D.S. (Doctor of Dental Surgery), or D.D.Sc. (Doctor of Dental Science) primarily engaged in the independent practice of general or specialized dentistry or dental surgery. These practitioners operate private or group practices in their own offices (e.g., centers, clinics) or in the facilities of others, such as hospitals or HMO medical centers. They can provide either comprehensive preventive, cosmetic, or emergency care, or specialize in a single field of dentistry."},{"id":"621300/healthcare practitioners (except physicians and dentists)/us","index":344,"name":"Healthcare practitioners (except physicians and dentists)","code":"621300","location":"US","description":"BEA Code \u0026 Name is '621300:Offices of other health practitioners'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments of independent health practitioners (except physicians and dentists)."},{"id":"621400/outpatient healthcare/us","index":345,"name":"Outpatient healthcare","code":"621400","location":"US","description":"BEA Code \u0026 Name is '621400:Outpatient care centers'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises (1) Family Planning Centers, (2) Outpatient Mental Health and Substance Abuse Centers, and (3) Other Outpatient Care Centers including:  (a) HMO Medical Centers, (b) Kidney Dialysis Centers, (c) Freestanding Ambulatory Surgical and Emergency Centers, and (d) All Other Outpatient Care Centers."},{"id":"621500/medical laboratories/us","index":346,"name":"Medical laboratories","code":"621500","location":"US","description":"BEA Code \u0026 Name is '621500:Medical and diagnostic laboratories'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments known as medical and diagnostic laboratories primarily engaged in providing analytic or diagnostic services, including body fluid analysis and diagnostic imaging, generally to the medical profession or to the patient on referral from a health practitioner."},{"id":"621600/home healthcare/us","index":347,"name":"Home healthcare","code":"621600","location":"US","description":"BEA Code \u0026 Name is '621600:Home health care services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in providing skilled nursing services in the home, along with a range of the following: personal care services; homemaker and companion services; physical therapy; medical social services; medications; medical equipment and supplies; counseling; 24- hour home care; occupation and vocational therapy; dietary and nutritional services; speech therapy; audiology; and high-tech care, such as intravenous therapy."},{"id":"621900/ambulances/us","index":348,"name":"Ambulances","code":"621900","location":"US","description":"BEA Code \u0026 Name is '621900:Other ambulatory health care services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in providing ambulatory health care services (except offices of physicians, dentists, and other health practitioners; outpatient care centers; medical laboratories and diagnostic imaging centers; and home health care providers)."},{"id":"622000/hospitals/us","index":349,"name":"Hospitals","code":"622000","location":"US","description":"BEA Code \u0026 Name is '622000:Hospitals'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Hospitals subsector provide medical, diagnostic, and treatment services that include physician, nursing, and other health services to inpatients and the specialized accommodation services required by inpatients. Hospitals may also provide outpatient services as a secondary activity. Establishments in the Hospitals subsector provide inpatient health services, many of which can only be provided using the specialized facilities and equipment that form a significant and integral part of the production process."},{"id":"623a00/nursing and community care facilities/us","index":350,"name":"Nursing and community care facilities","code":"623A00","location":"US","description":"BEA Code \u0026 Name is '623A00:Nursing and community care facilities'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: The Health Care and Social Assistance sector comprises establishments providing health care and social assistance for individuals. The sector includes both health care and social assistance because it is sometimes difficult to distinguish between the boundaries of these two activities. The industries in this sector are arranged on a continuum starting with those establishments providing medical care exclusively, continuing with those providing health care and social assistance, and finally finishing with those providing only social assistance. The services provided by establishments in this sector are delivered by trained professionals. All industries in the sector share this commonality of process, namely, labor inputs of health practitioners or social workers with the requisite expertise. Many of the industries in the sector are defined based on the educational degree held by the practitioners included in the industry.   Excluded from this sector are aerobic classes in Subsector 713, Amusement, Gambling and Recreation Industries and nonmedical diet and weight reducing centers in Subsector 812, Personal and Laundry Services. Although these can be viewed as health services, these services are not typically delivered by health practitioners. Related NAICS codes are: 6231, 6233"},{"id":"623b00/residential mental retardation, mental health, substance abuse and other facilities/us","index":351,"name":"Residential mental retardation, mental health, substance abuse and other facilities","code":"623B00","location":"US","description":"BEA Code \u0026 Name is '623B00:Residential mental retardation, mental health, substance abuse and other facilities'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: The Health Care and Social Assistance sector comprises establishments providing health care and social assistance for individuals. The sector includes both health care and social assistance because it is sometimes difficult to distinguish between the boundaries of these two activities. The industries in this sector are arranged on a continuum starting with those establishments providing medical care exclusively, continuing with those providing health care and social assistance, and finally finishing with those providing only social assistance. The services provided by establishments in this sector are delivered by trained professionals. All industries in the sector share this commonality of process, namely, labor inputs of health practitioners or social workers with the requisite expertise. Many of the industries in the sector are defined based on the educational degree held by the practitioners included in the industry.   Excluded from this sector are aerobic classes in Subsector 713, Amusement, Gambling and Recreation Industries and nonmedical diet and weight reducing centers in Subsector 812, Personal and Laundry Services. Although these can be viewed as health services, these services are not typically delivered by health practitioners. Related NAICS codes are: 6232, 6239"},{"id":"624100/individual and family services/us","index":352,"name":"Individual and family services","code":"624100","location":"US","description":"BEA Code \u0026 Name is '624100:Individual and family services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises (1) Child and Youth Services, (2) Services for the Elderly and Persons with Disabilities, and (3) Other Individual and Family Services."},{"id":"624a00/community food, housing, and other relief services, including rehabilitation services/us","index":353,"name":"Community food, housing, and other relief services, including rehabilitation services","code":"624A00","location":"US","description":"BEA Code \u0026 Name is '624A00:Community food, housing, and other relief services, including rehabilitation services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: The Health Care and Social Assistance sector comprises establishments providing health care and social assistance for individuals. The sector includes both health care and social assistance because it is sometimes difficult to distinguish between the boundaries of these two activities. The industries in this sector are arranged on a continuum starting with those establishments providing medical care exclusively, continuing with those providing health care and social assistance, and finally finishing with those providing only social assistance. The services provided by establishments in this sector are delivered by trained professionals. All industries in the sector share this commonality of process, namely, labor inputs of health practitioners or social workers with the requisite expertise. Many of the industries in the sector are defined based on the educational degree held by the practitioners included in the industry.   Excluded from this sector are aerobic classes in Subsector 713, Amusement, Gambling and Recreation Industries and nonmedical diet and weight reducing centers in Subsector 812, Personal and Laundry Services. Although these can be viewed as health services, these services are not typically delivered by health practitioners. Related NAICS codes are: 6242-3"},{"id":"624400/child day care/us","index":354,"name":"Child day care","code":"624400","location":"US","description":"BEA Code \u0026 Name is '624400:Child day care services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in providing day care of infants or children. These establishments generally care for preschool children, but may care for older children when they are not in school and may also offer pre-kindergarten educational programs."},{"id":"711100/performances/us","index":355,"name":"Performances","code":"711100","location":"US","description":"BEA Code \u0026 Name is '711100:Performing arts companies'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in producing live presentations involving the performances of actors and actresses, singers, dancers, musical groups and artists, and other performing artists."},{"id":"711200/sports/us","index":356,"name":"Sports","code":"711200","location":"US","description":"BEA Code \u0026 Name is '711200:Spectator sports'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises (1) sports teams or clubs primarily participating in live sporting events before a paying audience; (2) establishments primarily engaged in operating racetracks; (3) independent athletes engaged in participating in live sporting or racing events before a paying audience; (4) owners of racing participants, such as cars, dogs, and horses, primarily engaged in entering them in racing events or other spectator sports events; and (5) establishments, such as sports trainers, primarily engaged in providing specialized services to support participants in sports events or competitions. The sports teams and clubs included in this industry may or may not operate their own arena, stadium, or other facility for presenting their games or other spectator sports events."},{"id":"711a00/promoters and agents/us","index":357,"name":"Promoters and agents","code":"711A00","location":"US","description":"BEA Code \u0026 Name is '711A00:Promoters of performing arts and sports and agents for public figures'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: The Arts, Entertainment, and Recreation sector includes a wide range of establishments that operate facilities or provide services to meet varied cultural, entertainment, and recreational interests of their patrons. This sector comprises (1) establishments that are involved in producing, promoting, or participating in live performances, events, or exhibits intended for public viewing; (2) establishments that preserve and exhibit objects and sites of historical, cultural, or educational interest; and (3) establishments that operate facilities or provide services that enable patrons to participate in recreational activities or pursue amusement, hobby, and leisure-time interests.   Some establishments that provide cultural, entertainment, or recreational facilities and services are classified in other sectors. Excluded from this sector are: (1) establishments that provide both accommodations and recreational facilities, such as hunting and fishing camps and resort and casino hotels are classified in Subsector 721, Accommodation; (2) restaurants and night clubs that provide live entertainment in addition to the sale of food and beverages are classified in Subsector 722, Food Services and Drinking Places; (3) motion picture theaters, libraries and archives, and publishers of newspapers, magazines, books, periodicals, and computer software are classified in Sector 51, Information; and (4) establishments using transportation equipment to provide recreational and entertainment services, such as those operating sightseeing buses, dinner cruises, or helicopter rides, are classified in Subsector 487, Scenic and Sightseeing Transportation. Related NAICS codes are: 7113-4"},{"id":"711500/independent artists, writers, and performers/us","index":358,"name":"Independent artists, writers, and performers","code":"711500","location":"US","description":"BEA Code \u0026 Name is '711500:Independent artists, writers, and performers'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises independent (i.e., freelance) individuals primarily engaged in performing in artistic productions, in creating artistic and cultural works or productions, or in providing technical expertise necessary for these productions. This industry also includes athletes and other celebrities exclusively engaged in endorsing products and making speeches or public appearances for which they receive a fee."},{"id":"712000/museums, historical sites, zoos, and parks/us","index":359,"name":"Museums, historical sites, zoos, and parks","code":"712000","location":"US","description":"BEA Code \u0026 Name is '712000:Museums, historical sites, zoos, and parks'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Museums, Historical Sites, and Similar Institutions subsector engage in the preservation and exhibition of objects, sites, and natural wonders of historical, cultural, and/or educational value."},{"id":"713100/amusement parks and arcades/us","index":360,"name":"Amusement parks and arcades","code":"713100","location":"US","description":"BEA Code \u0026 Name is '713100:Amusement parks and arcades'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in operating amusement parks and amusement arcades and parlors."},{"id":"713200/gambling establishments (except casino hotels)/us","index":361,"name":"Gambling establishments (except casino hotels)","code":"713200","location":"US","description":"BEA Code \u0026 Name is '713200:Gambling industries (except casino hotels)'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments (except casino hotels) primarily engaged in operating gambling facilities, such as casinos, bingo halls, and video gaming terminals, or in the provision of gambling services, such as lotteries and off-track betting. Casino hotels are classified in Industry 72112, Casino Hotels."},{"id":"713900/golf courses, marinas, ski resorts, fitness and other rec centers and industries/us","index":362,"name":"Golf courses, marinas, ski resorts, fitness and other rec centers and industries","code":"713900","location":"US","description":"BEA Code \u0026 Name is '713900:Other amusement and recreation industries'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises (1) Golf Courses and Country Clubs, (2) Skiing Facilities, (3) Marinas, (4) Fitness and Recreational Sports Centers, (5) Bowling Centers, and (6) All Other Amusement and Recreation Industries."},{"id":"721000/hotels and campgrounds/us","index":363,"name":"Hotels and campgrounds","code":"721000","location":"US","description":"BEA Code \u0026 Name is '721000:Accommodation'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Accommodation subsector provide lodging or short-term accommodations for travelers, vacationers, and others. There is a wide range of establishments in these industries. Some provide lodging only; while others provide meals, laundry services, and recreational facilities, as well as lodging. Lodging establishments are classified in this subsector even if the provision of complementary services generates more revenue. The types of complementary services provided vary from establishment to establishment. The subsector is organized into three industry groups: (1) traveler accommodation, (2) recreational accommodation, and (3) rooming and boarding houses. The Traveler Accommodation industry group includes establishments that primarily provide traditional types of lodging services. This group includes hotels, motels, and bed and breakfast inns. In addition to lodging, these establishments may provide a range of other services to their guests. The RV (Recreational Vehicle) Parks and Recreational Camps industry group includes establishments that operate lodging facilities primarily designed to accommodate outdoor enthusiasts. Included are travel trailer campsites, recreational vehicle parks, and outdoor adventure retreats. The Rooming and Boarding Houses industry group includes establishments providing temporary or longer-term accommodations, which for the period of occupancy, may serve as a principal residence. Board (i.e., meals) may be provided but is not essential. Establishments that manage short-stay accommodation establishments (e.g., hotels and motels) on a contractual basis are classified in this subsector if they both manage the operation and provide the operating staff. Such establishments are classified based on the type of facility managed and operated."},{"id":"722110/full-service restaurants/us","index":364,"name":"Full-service restaurants","code":"722110","location":"US","description":"BEA Code \u0026 Name is '722110:Full-service restaurants'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in providing food services to patrons who order and are served while seated (i.e., waiter/waitress service) and pay after eating. These establishments may provide this type of food service to patrons in combination with selling alcoholic beverages, providing carry out services, or presenting live nontheatrical entertainment."},{"id":"722211/limited-service restaurants/us","index":365,"name":"Limited-service restaurants","code":"722211","location":"US","description":"BEA Code \u0026 Name is '722211:Limited-service restaurants'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This U.S. industry comprises establishments primarily engaged in providing food services (except snack and nonalcoholic beverage bars) where patrons generally order or select items and pay before eating. Food and drink may be consumed on premises, taken out, or delivered to the customer's location. Some establishments in this industry may provide these food services in combination with selling alcoholic beverages."},{"id":"722a00/all other food and drinking places/us","index":366,"name":"All other food and drinking places","code":"722A00","location":"US","description":"BEA Code \u0026 Name is '722A00:All other food and drinking places'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: The Accommodation and Food Services sector comprises establishments providing customers with lodging and/or preparing meals, snacks, and beverages for immediate consumption. The sector includes both accommodation and food services establishments because the two activities are often combined at the same establishment.   Excluded from this sector are civic and social organizations; amusement and recreation parks; theaters; and other recreation or entertainment facilities providing food and beverage services. Related NAICS codes are: 7223-4"},{"id":"811100/vehicle repair/us","index":367,"name":"Vehicle repair","code":"811100","location":"US","description":"BEA Code \u0026 Name is '811100:Automotive repair and maintenance'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments involved in providing repair and maintenance services for automotive vehicles, such as passenger cars, trucks, and vans, and all trailers. Establishments in this industry group employ mechanics with specialized technical skills to diagnose and repair the mechanical and electrical systems for automotive vehicles, repair automotive interiors, and paint or repair automotive exteriors."},{"id":"811200/electronic  equipment repair and maintenance/us","index":368,"name":"Electronic  equipment repair and maintenance","code":"811200","location":"US","description":"BEA Code \u0026 Name is '811200:Electronic and precision equipment repair and maintenance'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in repairing electronic equipment, such as computers and communications equipment, and highly specialized precision instruments. Establishments in this industry group typically have staff skilled in repairing items having complex, electronic components."},{"id":"811300/commercial machinery repair/us","index":369,"name":"Commercial machinery repair","code":"811300","location":"US","description":"BEA Code \u0026 Name is '811300:Commercial and industrial machinery and equipment repair and maintenance'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises establishments primarily engaged in the repair and maintenance of commercial and industrial machinery and equipment. Establishments in this industry either sharpen/install commercial and industrial machinery blades and saws or provide welding (e.g., automotive, general) repair services; or repair agricultural and other heavy and industrial machinery and equipment (e.g., forklifts and other materials handling equipment, machine tools, commercial refrigeration equipment, construction equipment, and mining machinery)."},{"id":"811400/household goods repair/us","index":370,"name":"Household goods repair","code":"811400","location":"US","description":"BEA Code \u0026 Name is '811400:Personal and household goods repair and maintenance'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises (1) Home and Garden Equipment and Appliance Repair and Maintenance, (2) Reupholstery and Furniture Repair, (3) Footwear and Leather Goods Repair, and (4) Other Personal and Household Goods Repair and Maintenance."},{"id":"812100/salons and barber shops/us","index":371,"name":"Salons and barber shops","code":"812100","location":"US","description":"BEA Code \u0026 Name is '812100:Personal care services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments, such as barber and beauty shops, that provide appearance care services to individual consumers."},{"id":"812200/funerary services/us","index":372,"name":"Funerary services","code":"812200","location":"US","description":"BEA Code \u0026 Name is '812200:Death care services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises (1) Funeral Homes and Funeral Services, and (2) Cemeteries and Crematories."},{"id":"812300/dry-cleaning and laundry/us","index":373,"name":"Dry-cleaning and laundry","code":"812300","location":"US","description":"BEA Code \u0026 Name is '812300:Dry-cleaning and laundry services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises (1) Coin-Operated Laundries and Drycleaners, (2) Drycleaning and Laundry Services (except Coin-Operated), and (3) Linen and Uniform Supply."},{"id":"812900/pet care, photofinishing, parking and other sundry services/us","index":374,"name":"Pet care, photofinishing, parking and other sundry services","code":"812900","location":"US","description":"BEA Code \u0026 Name is '812900:Other personal services'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry group comprises establishments primarily engaged in providing personal services (except personal care services, death care services, or drycleaning and laundry services)."},{"id":"813100/religious organizations/us","index":375,"name":"Religious organizations","code":"813100","location":"US","description":"BEA Code \u0026 Name is '813100:Religious organizations'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: This industry comprises (1) establishments primarily engaged in operating religious organizations, such as churches, religious temples, and monasteries, and/or (2) establishments primarily engaged in administering an organized religion or promoting religious activities."},{"id":"813a00/grantmaking, giving, and social advocacy organizations/us","index":376,"name":"Grantmaking, giving, and social advocacy organizations","code":"813A00","location":"US","description":"BEA Code \u0026 Name is '813A00:Grantmaking, giving, and social advocacy organizations'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: The Other Services (except Public Administration) sector comprises establishments engaged in providing services not specifically provided for elsewhere in the classification system. Establishments in this sector are primarily engaged in activities, such as equipment and machinery repairing, promoting or administering religious activities, grantmaking, advocacy, and providing drycleaning and laundry services, personal care services, death care services, pet care services, photofinishing services, temporary parking services, and dating services.   Private households that engage in employing workers on or about the premises in activities primarily concerned with the operation of the household are included in this sector.   Excluded from this sector are establishments primarily engaged in retailing new equipment and also performing repairs and general maintenance on equipment. These establishments are classified in Sector 44-45, Retail Trade. Related NAICS codes are: 8132, 8133"},{"id":"813b00/civic, social, professional, and similar organizations/us","index":377,"name":"Civic, social, professional, and similar organizations","code":"813B00","location":"US","description":"BEA Code \u0026 Name is '813B00:Civic, social, professional, and similar organizations'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: The Other Services (except Public Administration) sector comprises establishments engaged in providing services not specifically provided for elsewhere in the classification system. Establishments in this sector are primarily engaged in activities, such as equipment and machinery repairing, promoting or administering religious activities, grantmaking, advocacy, and providing drycleaning and laundry services, personal care services, death care services, pet care services, photofinishing services, temporary parking services, and dating services.   Private households that engage in employing workers on or about the premises in activities primarily concerned with the operation of the household are included in this sector.   Excluded from this sector are establishments primarily engaged in retailing new equipment and also performing repairs and general maintenance on equipment. These establishments are classified in Sector 44-45, Retail Trade. Related NAICS codes are: 8134, 8139"},{"id":"814000/household employees/us","index":378,"name":"Household employees","code":"814000","location":"US","description":"BEA Code \u0026 Name is '814000:Private households'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: Industries in the Private Households subsector include private households that engage in employing workers on or about the premises in activities primarily concerned with the operation of the household. These private households may employ individuals, such as cooks, maids, butlers, and outside workers, such as gardeners, caretakers, and other maintenance workers."},{"id":"s00500/federal general government (defense)/us","index":379,"name":"Federal general government (defense)","code":"S00500","location":"US","description":"BEA Code \u0026 Name is 'S00500:Federal general government (defense)'."},{"id":"s00600/federal general government (nondefense)/us","index":380,"name":"Federal general government (nondefense)","code":"S00600","location":"US","description":"BEA Code \u0026 Name is 'S00600:Federal general government (nondefense)'."},{"id":"491000/postal service/us","index":381,"name":"Postal service","code":"491000","location":"US","description":"BEA Code \u0026 Name is '491000:Postal service'. Description of the primary industry producing this good or service, adapted from the Census Bureau NAICS 2007 descriptions: The Postal Service subsector includes the activities of the National Post Office and its subcontractors operating under a universal service obligation to provide mail services, and using the infrastructure required to fulfill that obligation. These services include delivering letters and small parcels. These articles can be described as those that can be handled by one person without using special equipment. This allows the collection, pick-up, and delivery operations to be done with limited labor costs and minimal equipment. Sorting and transportation activities, where necessary, are generally mechanized. The restriction to small parcels distinguishes these establishments from those in the transportation industries. These establishments may also provide express delivery services using the infrastructure established for provision of basic mail services. The traditional activity of the National Postal Service is described in this subsector. Subcontractors include rural post offices on contract to the Postal Service. Bulk transportation of mail on contract to the Postal Service is not included here, because it is usually done by transportation establishments that carry other customers' cargo as well. Establishments that provide courier and express delivery services without operating under a universal service obligation are classified in subsector 492, Couriers and Messengers."},{"id":"s00102/other federal government enterprises/us","index":382,"name":"Other federal government enterprises","code":"S00102","location":"US","description":"BEA Code \u0026 Name is 'S00102:Other federal government enterprises'."},{"id":"s00700/state and local general government/us","index":383,"name":"State and local general government","code":"S00700","location":"US","description":"BEA Code \u0026 Name is 'S00700:State and local general government'."},{"id":"s00203/other state and local government enterprises/us","index":384,"name":"Other state and local government enterprises","code":"S00203","location":"US","description":"BEA Code \u0026 Name is 'S00203:Other state and local government enterprises'."},{"id":"s00402/used and secondhand goods/us","index":385,"name":"Used and secondhand goods","code":"S00402","location":"US","description":"BEA Code \u0026 Name is 'S00402:Used and secondhand goods'.  We DO NOT recommend this be used for individual analysis - this is only used for model completeness."},{"id":"s00300/noncomparable imports/us","index":386,"name":"Noncomparable imports","code":"S00300","location":"US","description":"BEA Code \u0026 Name is 'S00300:Noncomparable imports'."},{"id":"s00900/rest of the world adjustment/us","index":387,"name":"Rest of the world adjustment","code":"S00900","location":"US","description":"BEA Code \u0026 Name is 'S00900:Rest of the world adjustment'.  We DO NOT recommend this be used for individual analysis - this is only used for model completeness."}]